{
	"Question": [
	{
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AmazonCloudWatch/latest/events/RunLambdaSchedule.html"
				},
				"questionId": {
					"N": "590"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create an Amazon EC2 instance and schedule a cron to invoke the Lambda function."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create a Repeat Time variable inside the Lambda function to invoke the Lamdba function."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create a second Lambda function to monitor and invoke the first Lamdba function."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create an Amazon CloudWatch scheduled event to invoke the Lambda function."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A Developer created an AWS Lambda function and has asked the SysOps Administrator to make this function run every 15 minutes. What is the MOST efficient way to accomplish this request?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "0"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/config/latest/developerguide/evaluate-config-rules.html"
				},
				"questionId": {
					"N": "591"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Add AWS CloudTrail logging for the S3 buckets."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Implement IAM policies to allow only the Storage team to create S3 buckets."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Add the AWS Config managed rule S3_BUCKET_LOGGING_ENABLED."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create an AWS Lambda function to delete the S3 buckets if logging is not turned on."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company's Auditor implemented a compliance requirement that all Amazon S3 buckets must have logging enabled. How should the SysOps Administrator ensure this compliance requirement is met, while still permitting Developers to create and use new S3 buckets?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "1"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "https://aws.amazon.com/blogs/database/implementing-a-disaster-recovery-strategy-with-amazon-rds/"
				},
				"questionId": {
					"N": "592"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Enable Multi-AZ on the RDS instance to maintain the data in a second Availability Zone."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create a read replica of the RDS instance to maintain the data in a second region."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Ensure that automated backups are enabled and set the appropriate retention period."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Enable versioning in RDS to recover altered table data when needed."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An organization is concerned that its Amazon RDS databases are not protected. The solution to address this issue must be low cost, protect against table corruption that could be overlooked for several days, and must offer a 30-day window of protection. How can these requirements be met?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "2"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "VPC default limit is 5. While using the same Cloud Formation base Template to create VPC, it could have breached the limit."
				},
				"questionId": {
					"N": "593"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "The Amazon Machine image used is not available in that region."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "The AWS CloudFormation template needs to be updated to the latest version."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "The VPC configuration parameters have changed and must be updated in the template."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "The account has reached the default limit for VPCs allowed."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An organization is running multiple applications for their customers. Each application is deployed by running a base AWS CloudFormation template that configures a new VPC. All applications are run in the same AWS account and AWS Region. A SysOps Administrator has noticed that when trying to deploy the same AWS CloudFormation stack, it fails to deploy. What is likely to be the problem?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "3"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "I think the answer should be C. Since Aurora is AWS managed, the execution of all maintenance related tasks is owned by AWS."
				},
				"questionId": {
					"N": "594"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Performing underlying OS updates"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Provisioning of storage for database"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Scheduling maintenance, patches, and other updates"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Executing maintenance, patches, and other updates"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "Based on the AWS Shared Responsibility Model, which of the following actions are the responsibility of the customer for an Aurora database?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "4"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AmazonRDS/latest/AuroraUserGuide/CHAP_Troubleshooting.html#CHAP_Troubleshooting.MySQL.ReplicaLag"
				},
				"questionId": {
					"N": "595"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Users cannot add any items to the shopping cart."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Users intermittently notice that the cart is not updated correctly."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Users cannot remove any items from the shopping cart."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Users cannot use the application because it is falling back to an error page."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A web-commerce application stores its data in an Amazon Aurora DB cluster with an Aurora replica. The application displays shopping cart information by reading data from the reader endpoint. When monitoring the Aurora database, the SysOps Administrator sees that the AuroraReplicaLagMaximum metric for a single replica is high. What behavior is the application MOST likely exhibiting to users?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "5"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/using-cfn-updating-stacks-changesets.html"
				},
				"questionId": {
					"N": "596"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Implement a blue/green strategy using AWS Elastic Beanstalk."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Perform a canary deployment using Application Load Balancers and target groups."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create a change set for the running stack."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Submit the update using the UpdateStack API call."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company would like to review each change in the infrastructure before deploying updates in its AWS CloudFormation stacks. Which action will allow an Administrator to understand the impact of these changes before implementation?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "6"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/sharingamis-explicit.html"
				},
				"questionId": {
					"N": "597"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Contact AWS Support for sharing AMIs with other AWS accounts. "
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Modify the permissions on the AMIs so that they are publicly accessible."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Modify the permissions on the IAM role that are associated with the AMI."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Share the AMIs with each AWS account using the console or CLI."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A Systems Administrator is responsible for maintaining custom, approved AMIs for a company. These AMIs must be shared with each of the company's AWS accounts. How can the Administrator address this issue?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "7"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/snapshot-lifecycle.html"
				},
				"questionId": {
					"N": "598"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use an Amazon S3 lifecycle policy to delete snapshots older than two years."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Configure Amazon Inspector to find and delete old EBS snapshots."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Schedule an AWS Lambda function using Amazon CloudWatch Events to periodically run a script to delete old snapshots."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Configure an Amazon CloudWatch alarm to trigger the launch of an AWS CloudFormation template that will clean the older snapshots."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company's data retention policy dictates that backups be stored for exactly two years. After that time, the data must be deleted. How can Amazon EBS snapshots be managed to conform to this data retention policy?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "8"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "(Reactive governance is used to identify improper tags, programmatically using tools such as the Resource Groups Tagging API, AWS Config Rules, and custom scripts, or manually using Tag Editor and detailed billing reports. Proactive governance leverages tools such as AWS CloudFormation, AWS Service Catalog, or IAM resource-level permissions to ensure standardized tags are consistently applied at resource creation. For example, you can use the AWS CloudFormation Resource Tags property to apply tags to certain resource types. In AWS Service Catalog, you can add portfolio and product tags that are combined and applied to a provisioned product automatically when it is launched.)"
				},
				"questionId": {
					"N": "599"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use the AWS Tag Editor to manually search for untagged resources and then tag them properly in the editor."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Set up AWS Service Catalog with the TagOptions Library rule that enforces a tagging taxonomy proactively when instances and volumes are launched."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "In a PowerShell or shell script, check for untagged items by using the resource tagging GetResources API action, and then manually tag the reported items."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Launch items by using the AWS API. Use the TagResources API action to apply the required tags when the instances and volumes are launched."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator must devise a strategy for enforcing tagging of all EC2 instances and Amazon Elastic Block Store (Amazon EBS) volumes. What action can the Administrator take to implement this for real-time enforcement?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "9"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "AWS WAF protects web applications from attacks by filtering traffic based on rules that you create. For example, you can filter web requests based on IP addresses, HTTP headers, HTTP body, or URI strings, which allows you to block common attack patterns, such as SQL injection or cross-site scripting."
				},
				"questionId": {
					"N": "600"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Amazon Inspector"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Amazon Security Groups"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "AWS WAF"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Application Load Balancer (ALB)"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "During a security investigation, it is determined that there is a coordinated attack on the web applications deployed on Amazon EC2. The attack is performed through malformed HTTP headers. What AWS service of feature would prevent this traffic from reaching the EC2 instances?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "10"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "Yes.Even though D is correct, in Real time, if you use sticky session along with ELB then, Load will go to particular instance only if the request repeatedly comes from same instance and will impact the load spread."
				},
				"questionId": {
					"N": "601"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Confirm that the Application Load Balancer is in a multi-AZ configuration."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Enable health checks on the Application Load Balancer."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Ensure that port 80 is configured on the security group."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Enable sticky sessions on the Application Load Balancer."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company is deploying a legacy web application on Amazon EC2 instances behind an ELB Application Load Balancer. The application worked well in the test environment. However, in production, users report that they are prompted to log in to the system several times an hour. Which troubleshooting step should be taken to help resolve the problem reported by users?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "11"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "Require users to use temporary credentials from the get-session token command to sign API calls.IAM users can request temporary security credentials for their own use by calling the AWS STS GetSessionToken API. The default expiration for these temporary credentials is 12 hours; the minimum is 15 minutes, and the maximum is 36 hours.You can also use temporary credentials with Multi-Factor Authentication (MFA)-Protected API Access."
				},
				"questionId": {
					"N": "602"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Enable MFA on IAM roles, and require IAM users to use role credentials to sign API calls."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Ask the IAM users to log into the AWS Management Console with MFA before making API calls using the CLI."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Restrict the IAM users to use of the console, as MFA is not supported for CLI use."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Require users to use temporary credentials from the get-session token command to sign API calls."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company has mandated the use of multi-factor authentication (MFA) for all IAM users, and requires users to make all API-calls using the CLI. However, users are not prompted to enter MFA tokens, and are able to run CLI commands without MFA. In an attempt to enforce MFA, the company attached an IAM policy to all users that denies API calls that have not been authenticated with MFA. What additional step must be taken to ensure that API calls are authenticated using MFA?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "12"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "EFS makes more sensehttps://dzone.com/articles/confused-by-aws-storage-options-s3-ebs-amp-efs-explainedYou can mount EFS onto several EC2 instances at the same time"
				},
				"questionId": {
					"N": "603"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Amazon S3 buckets with lifecycle policies to delete old objects."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Amazon RDS PostgreSQL and a job that deletes rows based on age and file type columns."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Amazon EFS and a scheduled process to delete files based on age and extension."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "An EC2 instance store synced on boot from a central Amazon EBS-backed instance."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An application is being developed that will be served across a fleet of Amazon EC2 instances, which require a consistent view of persistent data. Items stored vary in size from 1KB to 300MB; the items are read frequently, created occasionally, and often require partial changes without conflict. The data store is not expected to grow beyond 2TB, and items will be expired according to age and content type. Which AWS service solution meets these requirements?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "13"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "IPV4 --> NATIPV6--> Egress-Onlyhttps://docs.aws.amazon.com/vpc/latest/userguide/egress-only-internet-gateway.html#egress-only-internet-gateway-working-with"
				},
				"questionId": {
					"N": "604"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Route ::/0 traffic to a NAT gateway"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Route ::/0 traffic to an internet gateway"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Route 0.0.0.0/0 traffic to an egress-only internet gateway"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Route ::/0 traffic to an egress-only internet gateway"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator created an Amazon VPC with an IPv6 CIDR block, which requires access to the internet. However, access from the internet towards the VPC is prohibited. After adding and configuring the required components to the VPC, the Administrator is unable to connect to any of the domains that reside on the internet. What additional route destination rule should the Administrator add to the route tables?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "14"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/Concepts.MultiAZ.html"
				},
				"questionId": {
					"N": "605"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Switch to an active/passive database pair using the create-db-instance-read-replica with the - -availability-zone flag."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Specify high availability when creating a new RDS instance, and live-migrate the data."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Modify the RDS instance using the console to include the Multi-AZ option."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use the modify-db-instance command with the - -ha flag."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A recent organizational audit uncovered an existing Amazon RDS database that is not currently configured for high availability. Given the critical nature of this database, it must be configured for high availability as soon as possible. How can this requirement be met?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "15"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "CE"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AmazonS3/latest/dev/bucket-encryption.html https://aws.amazon.com/blogs/security/how-to-prevent-uploads-of-unencrypted-objects-to-amazon-s3/"
				},
				"questionId": {
					"N": "606"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Implement AWS Shield to protect against unencrypted objects stored in S3 buckets."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Implement Object access control list (ACL) to deny unencrypted objects from being uploaded to the S3 bucket."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Implement Amazon S3 default encryption to make sure that any object being uploaded is encrypted before it is stored."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Implement Amazon Inspector to inspect objects uploaded to the S3 bucket to make sure that they are encrypted."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "E"
								},
								"optionText": {
									"S": "Implement S3 bucket policies to deny unencrypted objects from being uploaded to the buckets."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company must ensure that any objects uploaded to an S3 bucket are encrypted.  Which of the following actions will meet this requirement? (Choose two.)"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "16"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "Initially I thought A. But A is suited to do health check of entire AWS Regions & Services. While the Service Health Dashboard displays the general status of AWS services, Personal Health Dashboard gives you a personalized view into the performance and availability of the AWS services underlying your AWS resources"
				},
				"questionId": {
					"N": "607"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "AWS Service Health Dashboard"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "AWS Trusted Advisor"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "AWS Personal Health Dashboard"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "AWS Systems Manager"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "When the AWS Cloud infrastructure experiences an event that may impact an organization, which AWS service can be used to see which of the organization's resources are affected?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "17"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AmazonCloudFront/latest/DeveloperGuide/http-503-service-unavailable.html"
				},
				"questionId": {
					"N": "608"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "The request rate to Amazon S3 is too high."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "There is an error with the Amazon RDS database."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "The requests to Amazon S3 do not have the proper permissions."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "The users are in a different geographical region and Amazon Route 53 is restricting access."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company's static website hosted on Amazon S3 was launched recently, and is being used by tens of thousands of users. Subsequently, website users are experiencing 503 service unavailable errors. Why are these errors occurring?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "18"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "Ref: https://docs.aws.amazon.com/IAM/latest/UserGuide/tutorial_cross-account-with-roles.html"
				},
				"questionId": {
					"N": "609"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create an IAM role in the Production account with the Development account as a trusted entity and then allow those users from the Development account to assume the Production account IAM role."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create a group of IAM users in the Development account, and add Production account service ARNs as resources in the IAM policy."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Establish a federation between the two accounts using the on-premises Microsoft Active Directory, and allow the Development account to access the Production account through this federation."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Establish an Amazon Cognito Federated Identity between the two accounts, and allow the Development account to access the Production account through this federation."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An organization has two AWS accounts: Development and Production. A SysOps Administrator manages access of IAM users to both accounts. Some IAM users in Development should have access to certain resources in Production. How can this be accomplished?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "19"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "READ REBOOT"
				},
				"questionId": {
					"N": "610"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create an Amazon CloudWatch alarm on the CPUCreditBalance metric and specify a terminate alarm action. "
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create an Amazon CloudWatch alarm on the CPUUtilization metric and specify a reboot alarm action."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create an Amazon CloudWatch alarm on the CPUCreditBalance metric and specify a reboot alarm action."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create an Amazon CloudWatch alarm on the CPUUtilization metric and specify a terminate alarm action."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is responsible for managing a set of 12.micro Amazon EC2 instances. The Administrator wants to automatically reboot any instance that exceeds 80% CPU utilization. Which of these solutions would meet the requirements?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "20"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "CLOUDFRONT PROVIDES S3 CONTENT TO EDGE LOCATIONS"
				},
				"questionId": {
					"N": "611"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Migrate the S3 bucket to a region that is closer to end users' geographic locations."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Use cross-region replication to replicate all of the data to another region."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create an Amazon CloudFront distribution with the S3 bucket as the origin."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use Amazon ElastiCache to cache data being served from Amazon S3."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company's customers are reporting increased latency while accessing static web content from Amazon S3. A SysOps Administrator observed a very high rate of read operations on a particular S3 bucket. What will minimize latency by reducing load on the S3 bucket?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "21"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "see https://aws.amazon.com/directconnect/faqs/Through Direct Connect, customer traffic will remain in Amazon's backbone network after it enters it. Therefore, prefixes of CloudFront locations that are not on the Amazon backbone network will not be advertised through Direct Connect. You can also find more details about IP prefixes advertised on <b> AWS Direct Connect public virtual interfaces here </b>. You can also refer to this link to know more about Direct Connect routing policy."
				},
				"questionId": {
					"N": "612"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Implement an IAM policy that uses the aws:sourceConnection condition to allow access from the AWS Direct Connect connection ID only"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Set up a public virtual interface on the AWS Direct Connect connection"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Configure AWS Shield to protect the AWS Management Console from being accessed by IP addresses other than those within the data center ranges"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Update all the VPC network ACLs to allow access from the data center IP ranges"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company requires that all access from on-premises applications to AWS services go over its AWS Direct Connect connection rather than the public internet. How would a SysOps Administrator implement this requirement?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "22"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "https://aws.amazon.com/blogs/mt/monitoring-service-limits-with-trusted-advisor-and-amazon-cloudwatch/"
				},
				"questionId": {
					"N": "613"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use Amazon Inspector and Amazon CloudWatch Events."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Use AWS Trusted Advisor and Amazon CloudWatch Events."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use the Personal Health Dashboard and CloudWatch Events."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use AWS CloudTrail and CloudWatch Events."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator must find a way to set up alerts when Amazon EC2 service limits are close to being reached. How can the Administrator achieve this requirement?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "23"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "(Scaling Based on Amazon SQS:What happens if your upload levels change? If your uploads increase and decrease on a predictable schedule, you can specify the time and date to perform scaling activities. For more information, see Scheduled Scaling for Amazon EC2 Auto Scaling. A more dynamic way to scale your Auto Scaling group, scaling by policy, lets you define parameters that control the scaling process. For example, you can create a policy that calls for enlarging your fleet of EC2 instances whenever the average number of uploads reaches a certain level.)"
				},
				"questionId": {
					"N": "614"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create a scheduled scaling action to scale up in anticipation of the traffic."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Change the Auto Scaling group to scale up and down based on CPU utilization."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Change the launch configuration to launch larger EC2 instance types."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Modify the scaling policy to deploy more EC2 instances when scaling up."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A web application accepts orders from online users and places the orders into an Amazon SQS queue. Amazon EC2 instances in an EC2 Auto Scaling group read the messages from the queue, process the orders, and email order confirmations to the users. The Auto Scaling group scales up and down based on the queue depth. At the beginning of each business day, users report confirmation emails are delayed. What action will address this issue?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "24"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": " https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/aws-attribute-creationpolicy.htmlUse the CreationPolicy attribute when you want to wait on resource configuration actions before stack creation proceeds. For example, if you install and configure software applications on an EC2 instance, you might want those applications to be running before proceeding. In such cases, you can add a CreationPolicy attribute to the instance, and then send a success signal to the instance after the applications are installed and configured."
				},
				"questionId": {
					"N": "615"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Conditions with a timeout set to 4 hours."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "CreationPolicy with a timeout set to 4 hours."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "DependsOn with a timeout set to 4 hours."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Metadata with a timeout set to 4 hours."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company creates custom AMI images by launching new Amazon EC2 instances from an AWS CloudFormation template. It installs and configures necessary software through AWS OpsWorks, and takes images of each EC2 instance. The process of installing and configuring software can take between 2 to 3 hours, but at times, the process stalls due to installation errors. The SysOps Administrator must modify the CloudFormation template so if the process stalls, the entire stack will fail and roll back. Based on these requirements, what should be added to the template?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "25"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/cfn-ug.pdf#best-practices"
				},
				"questionId": {
					"N": "616"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Include the S3 bucket as a mapping in each template."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Add the S3 bucket as a resource in each template."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create the S3 bucket in its own template and export it."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Generate the S3 bucket using StackSets."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator must take a team's single existing AWS CloudFormation template and split it into smaller, service-specific templates. All of the services in the template reference a single, shared Amazon S3 bucket. What should the Administrator do to ensure that this S3 bucket can be referenced by all the service templates?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "26"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "BE"
				},
				"questionAnswerExplanation": {
					"S": "https://aws.amazon.com/premiumsupport/knowledge-center/push-log-data-cloudwatch-awslogs/ResolutionBefore you begin, confirm that the awslogs agent is able to connect to the CloudWatch Logs API endpoint.Be sure that your configuration has:Internet connectivityValid security group configurationsValid network access control lists (network ACLs)"
				},
				"questionId": {
					"N": "617"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "A custom of third-party solution for logs is being used."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "The IAM role attached to the EC2 instance does not have the proper permissions."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "The CloudWatch agent does not support the operating system used."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "A billing constraint is limiting the number of CloudWatch Logs within this account."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "E"
								},
								"optionText": {
									"S": "The EC2 instance is in a private subnet, and the VPC does not have a NAT gateway."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "After installing and configuring the Amazon CloudWatch agent on an EC2 instance, the anticipated system logs are not being received by CloudWatch Logs. Which of the following are likely to be the cause of this problem? (Choose two.)"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "27"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "BD"
				},
				"questionAnswerExplanation": {
					"S": "After you've created a flow log, it can take several minutes to begin collecting and publishing data to the chosen destinations. Flow logs do not capture real-time log streams for your network interfaces. Ref: https://docs.aws.amazon.com/vpc/latest/userguide/flow-logs.html#flow-logs-basics"
				},
				"questionId": {
					"N": "618"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "The Administrator must configure the VPC Flow Logs to have them sent to AWS CloudTrail."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "The Administrator has waited less than ten minutes for the log group to be created in CloudWatch."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "The account VPC Flow Logs have been disabled by using a service control policy."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "No relevant traffic has been sent since the VPC Flow Logs were created"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "E"
								},
								"optionText": {
									"S": "The account has Amazon GuardDuty enabled."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator found that a newly-deployed Amazon EC2 application server is unable to connect to an existing Amazon RDS database. After enabling VPC Flow Logs and confirming that the flow log is active on the console, the log group cannot be located in Amazon CloudWatch. What are the MOST likely reasons for this situation? (Choose two.)"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "28"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "if you want to allow your EC2 instance to serve HTTP traffic, you will need to allow port 80 inbound and ports 1024  65535 in NACL.ephemeral ports ports are randomly selected to allow return traffic for a request. So, if a request comes to the server on port 80, the request also specifies a random port between 1024  65535 for the return traffic. The stateful nature of the security group handles the ephemeral port requirement automatically. When the request comes in, it accesses the server on port 80, but also specifies a port for the return traffic. This port is one of the ports in the ephemeral range. The stateful Security Group automatically allows the return traffic on this port."
				},
				"questionId": {
					"N": "619"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Add a rule to the security group allowing outbound traffic on port 80."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Add a rule to the network ACL allowing outbound traffic on port 80."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Add a rule to the security group allowing outbound traffic on ports 1024 through 65535."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Add a rule to the network ACL allowing outbound traffic on ports 1024 through 65535."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An HTTP web application is launched on Amazon EC2 instances behind an ELB Application Load Balancer. The EC2 instances run across multiple Availability Zones. A network ACL and a security group for the load balancer and EC2 instances allow inbound traffic on port 80. After launch, the website cannot be reached over the internet. What additional step should be taken?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "29"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "will assure availability of at least ONE node in case of a second node fail."
				},
				"questionId": {
					"N": "620"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create an Auto Scaling group by using the launch configuration across at least 2 Availability Zones with a minimum size of 1, desired capacity of 1, and a maximum size of 1."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create an Auto Scaling group by using the launch configuration across at least 3 Availability Zones with a minimum size of 2, desired capacity of 2, and a maximum of 2."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create an Auto Scaling group by using the launch configuration across at least 2 regions with a minimum size of 1, desired capacity of 1, and a maximum size of 1."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create an Auto Scaling group by using the launch configuration across at least 3 regions with a minimum size of 2, desired capacity of 2, and a maximum size of 2."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company has an application that is running on an EC2 instance in one Availability Zone. A SysOps Administrator has been tasked with making the application highly available. The Administrator created a launch configuration from the running EC2 instance. The Administrator also properly configured a load balancer. What step should the Administrator complete next to make the application highly available?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "30"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "D is wrong because 10 instances were already launched.. that mean AMI is available.B should be correct"
				},
				"questionId": {
					"N": "621"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "The IAM user did not have privileges to launch the CloudFormation template."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "The t2.medium EC2 instance service limit was reached."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "An AWS Budgets threshold was breached."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "The application's Amazon Machine Image (AMI) is not available in us-east-2."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An Applications team has successfully deployed an AWS CloudFormation stack consisting of 30 t2-medium Amazon EC2 instances in the us-west-2 Region. When using the same template to launch a stack in useast- 2, the launch failed and rolled back after launching only 10 EC2 instances. What is a possible cause of this failure?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "31"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "B is correct C has some sense but S3-IA won't delete without added a delete policy"
				},
				"questionId": {
					"N": "622"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use Amazon CloudWatch Events to delete objects older than 6 months."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Implement lifecycle policies to delete objects older than 6 months."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use the Amazon S3 Standard-Infrequent Access (S3 Standard-IA) storage class to automatically delete objects older than 6 months."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create versioning rules to delete objects older than 6 months."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator stores crash dump files in Amazon S3. New security and privacy measures require that crash dumps older than 6 months be deleted. Which approach meets this requirement?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "32"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "since AWS delivers the AWS Cost & Usage Report (in CSV format) to whichever Amazon Simple Storage Service (S3) bucket you specify, and updates the reports at least once per day.https://aws.amazon.com/aws-cost-management/aws-cost-and-usage-reporting/"
				},
				"questionId": {
					"N": "623"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use Amazon CloudWatch Events to schedule a billing inquiry on a bi-weekly basis. Use AWS Glue to convert the output to CSV."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Set AWS Cost and Usage Reports to publish bills daily to an Amazon S3 bucket in CSV format."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use the AWS CLI to output billing data as JSON. Use Amazon SES to email bills on a daily basis."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use AWS Lambda, triggered by CloudWatch, to query billing data and push to Amazon RDS."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "The Accounting department would like to receive billing updates more than once a month. They would like  the updates to be in a format that can easily be viewed with a spreadsheet application. How can this request be fulfilled?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "33"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "You will still have to copy the AMI from us-east-1 to us-west-2 region, and then use the appropriate image ID in the mappings section of CloudFormation. That way you don't have to hardcode the AMI ID in your CFT, and use the same template in any region as long as the mapping section covers that region and the corresponding AMI ID."
				},
				"questionId": {
					"N": "624"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Copy the source region's Amazon Machine Image (AMI) to the destination region and assign it the same ID."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Edit the AWS CloudFormation template to specify the region code as part of the fully qualified AMI ID."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Edit the AWS CloudFormation template to offer a drop-down list of all AMIs to the user by using the AWS::EC2::AMI::ImageID control."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Modify the AWS CloudFormation template by including the AMI IDs in the 'Mappings' section. Refer to the proper mapping within the template for the proper AMI ID."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is troubleshooting an AWS CloudFormation template whereby multiple Amazon EC2 instances are being created. The template is working in us-east-1, but it is failing in us-west-2 with the error code: AMI [ami-12345678] does not exist How should the Administrator ensure that the AWS CloudFormation template is working in every region?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "34"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "After long research, I also vote for ans C. MFA is also Part of root user security and AWS always enforces. So Trusted advisor will check whether the root account is enabled for MFA or not"
				},
				"questionId": {
					"N": "625"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Change the root user password by using the AWS CLI routinely."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Periodically use the AWS CLI to rotate access keys and secret keys for the root user."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use AWS Trusted Advisor security checks to review the configuration of the root user."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Periodically distribute the AWS compliance document from AWS Artifact that governs the root user configuration."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator needs to confirm that security best practices are being followed with the AWS account root user. How should the Administrator ensure that this is done?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "35"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "VPC Peering needs route table update, C is correct"
				},
				"questionId": {
					"N": "626"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "One of the VPCs is not sized correctly for peering."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "There is no public subnet in one of the VPCs."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "The route tables have not been updated."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "One VPC has disabled the peering flag."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "The networking team has created a VPC in an AWS account. The application team has asked for access to resources in another VPC in the same AWS account. The SysOps Administrator has created the VPC peering connection between both the accounts, but the resources in one VPC cannot communicate with the resources in the other VPC. What could be causing this issue?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "36"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "M5 is based on new nitro hypervisor and is cheaper than previous generations. https://aws.amazon.com/about-aws/whats-new/2018/07/amazon-ec2-nitro-system-based-instances-now-support-faster-ebs-optimized-performance/"
				},
				"questionId": {
					"N": "627"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Purchase Reserved Instances for the specific m2 instances."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Change the m2 instances to equivalent m5 types, and purchase Reserved Instances for the specific m5 instances."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Change the Classic Load Balancer to an Application Load Balancer, and purchase Reserved Instances for the specific m2 instances."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Purchase Spot Instances for the specific m2 instances."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An organization has been running their website on several m2 Linux instances behind a Classic Load Balancer for more than two years. Traffic and utilization have been constant and predictable.  What should the organization do to reduce costs?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "37"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "It should be C, (VPC endpoint)Customer is trying to store date from client VPC to S3, so VPC endpoint.Direct connect is required when you want on-premise data to be kept in S3 privately.Ref: https://docs.aws.amazon.com/vpc/latest/userguide/vpc-endpoints.html"
				},
				"questionId": {
					"N": "628"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use AWS Direct Connect and a public virtual interface to connect to Amazon S3."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Use a managed NAT gateway to connect to Amazon S3."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Deploy a VPC endpoint to connect to Amazon S3."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Deploy an internet gateway to connect to Amazon S3."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company is storing monthly reports on Amazon S3. The company's security requirement states that traffic from the client VPC to Amazon S3 cannot traverse the internet. What should the SysOps Administrator do to meet this requirement?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "38"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "AD"
				},
				"questionAnswerExplanation": {
					"S": "B.ASG Not required.C.New Subnet Not required in this case.E. No Point of security."
				},
				"questionId": {
					"N": "629"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Add the EC2 instances to the ALB target group, configure the health check, and ensure that the instances report healthy."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Add the EC2 instances to an Auto Scaling group, configure the health check to ensure that the instances report healthy, and remove the public IPs from the instances."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create a new subnet in which EC2 instances and ALB will reside to ensure that they can communicate, and remove the public IPs from the instances."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Change the security group for the EC2 instances to allow access from only the ALB security group, and remove the public IPs from the instances."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "E"
								},
								"optionText": {
									"S": "Change the security group to allow access from 0.0.0.0/0, which permits access from the ALB."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An application resides on multiple EC2 instances in public subnets in two Availability Zones. To improve security, the Information Security team has deployed an Application Load Balancer (ALB) in separate subnets and pointed the DNS at the ALB instead of the EC2 instances. After the change, traffic is not reaching the instances, and an error is being returned from the ALB. What steps must a SysOps Administrator take to resolve this issue and improve the security of the application? (Choose two.)"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "39"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "When configuring the security setting in the ALB, there is an option to request Certificates from ACM. The domain name that needs to be used when requesting the certificate, we need to provide the FQDN of the site.. if we use the FQDN of the ALB in the request im not sure if it will work.. hence my answer would be B."
				},
				"questionId": {
					"N": "630"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Contact the domain registrar and ask them to provide the verification required by AWS."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Place a new request with the proper domain name instead of the ALB FQDN"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Select the certificate request in the ACM console and resend the validation email."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Contact AWS Support and verify the request by answering security challenge questions."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is implementing SSL for a domain of an internet-facing application running behind an Application Load Balancer (ALB). The Administrator decides to use an SSL certificate from Amazon Certificate Manager (ACM) to secure it. Upon creating a request for the ALB fully qualified domain name (FQDN), it fails, and the error message 'Domain Not Allowed' is displayed. How can the Administrator fix this issue?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "40"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/elasticloadbalancing/latest/application/tutorial-load-balancer-routing.html If you are running microservices, you can route traffic to multiple back-end services using path-based routing. For example, you can route general requests to one target group and requests to render images to another target group."
				},
				"questionId": {
					"N": "631"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use Amazon CloudFront to log the URL and forward the request."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Use Amazon CloudFront to rewrite the header based on the microservice and forward the request."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use an Application Load Balancer (ALB) and do path-based routing."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use a Network Load Balancer (NLB) and do path-based routing."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator runs a web application that is using a microservices approach whereby different  responsibilities of the application have been divided in a separate microservice running on a different Amazon EC2 instance. The Administrator has been tasked with reconfiguring the infrastructure to support this approach. How can the Administrator accomplish this with the LEAST administrative overhead?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "41"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AmazonElastiCache/latest/red-ug/redis-cluster-resharding-online.html"
				},
				"questionId": {
					"N": "632"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use Amazon RDS Multi-AZ."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Add shards to the existing Redis cluster."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Offload static data to Amazon S3."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Launch a second Multi-AZ Redis cluster."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company is running a popular social media site on EC2 instances. The application stores data in an Amazon RDS for MySQL DB instance and has implemented read caching by using an ElastiCache for Redis (cluster mode enabled) cluster to improve read times. A social event is happening over the weekend, and the SysOps Administrator expects website traffic to triple. What can a SysOps Administrator do to ensure improved read times for users during the social event?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "42"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/awsaccountbilling/latest/aboutv2/ce-forecast.html"
				},
				"questionId": {
					"N": "633"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "AWS Trusted Advisor"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Amazon QuickSight"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "AWS Cost and Usage Report"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "AWS Cost Explorer"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "After a particularly high AWS bill, an organization wants to review the use of AWS services. What AWS service will allow the SysOps Administrator to quickly view this information to share it, and will also forecast expenses for the current billing period?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "43"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/efs/latest/ug/efs-enforce-encryption.html"
				},
				"questionId": {
					"N": "634"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Update the EFS file system settings to enable server-side encryption using AES-256."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create a new encrypted EFS file system and copy the data from the unencrypted EFS file system to the new encrypted EFS file system."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use AWS CloudHSM to encrypt the files directly before storing them in the EFS file system."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Modify the EFS file system mount options to enable Transport Layer Security (TLS) on each of the EC2 instances."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company has adopted a security policy that requires all customer data to be encrypted at rest. Currently, customer data is stored on a central Amazon EFS file system and accessed by a number of different applications from Amazon EC2 instances. How can the SysOps Administrator ensure that all customer data stored on the EFS file system meets the new requirement?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "44"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "DB Snapshots are user-initiated and enable you to back up your DB instance in a known state as frequently as you wish, and then restore to that specific state at any time"
				},
				"questionId": {
					"N": "635"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Attach an Amazon EBS volume with Oracle RMAN installed to the RDS instance."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Take a snapshot of the EBS volume that is attached to the DB instance."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Install Oracle Secure Backup on the RDS instance and back up the Oracle database to Amazon S3."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Take a snapshot of the DB instance."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "The Database Administration team is interested in performing manual backups of an Amazon RDS Oracle DB instance. What steps should be taken to perform the backups? "
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "45"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "Answer is C, A is not correct, because you don't need alarming for scheduled scaling"
				},
				"questionId": {
					"N": "636"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "A scheduled scaling action has not been defined."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "In the field Suspend Process, 'ReplacesUnhealthy' has been selected."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "The maximum size of the Auto Scaling group is below or at the current group size."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "The Health Check Grace Period is set to less than 300 seconds."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An Auto Scaling group scales up and down based on Average CPU Utilization. The alarm is set to trigger a scaling event when the Average CPU Utilization exceeds 80% for 5 minutes. Currently, the Average CPU has been 95% for over two hours and new instances are not being added. What could be the issue?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "46"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/IAM/latest/UserGuide/id_roles_use_switch-role-ec2.htmlAlthough a role is usually assigned to an EC2 instance when you launch it, a role can also be attached to an EC2 instance that is already running."
				},
				"questionId": {
					"N": "637"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create an IAM user with the necessary privileges. Generate an access key and embed the key in the code running on the EC2 instances."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Install secure FTP (SFTP) software on the EC2 instances. Use an AWS Lambda function to copy the files from the EC2 instances to Amazon S3 using SFTP."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create an IAM role with the necessary privileges. Associate the role with the EC2 instances at launch."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use rsync and cron to set up the transfer of files from the EC2 instances to the S3 bucket. Enable AWS Shield to protect the data."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An application running on Amazon EC2 instances needs to write files to an Amazon S3 bucket. What is the MOST secure way to grant the application access to the S3 bucket?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "47"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/Route53/latest/APIReference/API_HealthCheckConfig.htmlHTTP_STR_MATCH: Route 53 tries to establish a TCP connection. If successful, Route 53 submits an HTTP request and searches the first 5,120 bytes of the response body for the string that you specify in SearchString.HTTPS_STR_MATCH: Route 53 tries to establish a TCP connection. If successful, Route 53 submits an HTTPS request and searches the first 5,120 bytes of the response body for the string that you specify in SearchString."
				},
				"questionId": {
					"N": "638"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "The search string is not HTML-encoded."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "The search string must be put in quotes."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "The search string must be escaped with a backslash (\\) before the forward slash (/)."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "The search string is not in the first 5120 bytes of the tested page."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "In configuring an Amazon Route 53 health check, a SysOps Administrator selects Yes' to the String Matching option in the Advanced Configuration section. In the Search String box, the Administrator types the following text: /html. This is to ensure that the entire page is loading during the health check. Within 5 minutes of enabling the health check, the Administrator receives an alert stating that the check failed. However, when the Administrator navigates to the page, it loads successfully. What is the MOST likely cause of this false alarm?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "48"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "it is a tricky question, in the scenario the question said that the developers have permissions to manipulate with IAM (therefore, answer B cant be correct, as they can edit the permissions and add what they want, with no restrictions).However, answer A, using SCP, will BLOCK them from accessing certain services, but it will not grant them actions.I would go with A, because even they are limited from accessing certain services through SCP, they can GRANT THEMSELVES the required actions using IAM policies.So this will resolve the What is the best way to grant the developer.....blah blah."
				},
				"questionId": {
					"N": "639"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create a service control policy in AWS Organizations and apply it to the development account."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create a customer managed policy in IAM and apply it to all users within the development account. "
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create a job function policy in IAM and apply it to all users within the development account."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create an IAM policy and apply it in API Gateway to restrict the development account."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company has created a separate AWS account for all development work to protect the production environment. In this development account, developers have permission to manipulate IAM policies and roles. Corporate policies require that developers are blocked from accessing some services. What is the BEST way to grant the developers privileges in the development account while still complying with corporate policies?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "49"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "Configure AWS Organizations Consolidated Billing and provide the finance team with IAM access to the billing console."
				},
				"questionId": {
					"N": "640"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Implement AWS Organizations and create a service control policy that defines the billing relationship with the new master account."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Configure AWS Organizations Consolidated Billing and provide the finance team with IAM access to the billing console."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Send Cost and Usage Reports files to a central Amazon S3 bucket, and load the data into Amazon Redshift. Use Amazon QuickSight to provide visualizations to the finance team."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Link the Reserved Instances to the master payer account and use Amazon Redshift Spectrum to query Detailed Billing Report data across all accounts."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "Company A purchases Company B and inherits three new AWS accounts. Company A would like to centralize billing and Reserved Instance benefits but wants to keep all other resources separate. How can this be accomplished?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "50"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "Cloudfront is more appropriate for Dynamic Websitehttps://acloud.guru/forums/aws-certified-solutions-architect-associate/discussion/-KbKW7V5i1NIZ6n9S_TK/what_is_the_difference_between"
				},
				"questionId": {
					"N": "641"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Implement Amazon ElastiCache to cache the content and reduce the load on the database."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Enable an Amazon CloudFront distribution with Elastic Load Balancing as a custom origin."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use Amazon S3 to store and deliver the content."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Enable Auto Scaling for the EC2 instances so that they can scale automatically."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A website uses Elastic Load Balancing (ELB) in front of several Amazon EC2 instances backed by an Amazon RDS database. The content is dynamically generated for visitors of a webpage based on their geographic location. and is updated daily. Some of the generated objects are large in size and are taking longer to download than they should, resulting in a poor user experience. Which approach will improve the user experience?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "51"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "You must provide the Internet-routable IP address of the customer gateway's external interface. The IP address must be static and can be behind a device performing network address translation (NAT). D."
				},
				"questionId": {
					"N": "642"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "The private IP address of the customer gateway device"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "The MAC address of the NAT device in front of the customer gateway device"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "The public IP address of the customer gateway device"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "The public IP address of the NAT device in front of the customer gateway device"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "While setting up an AWS managed VPN connection, a SysOPs Administrator creates a customer gateway resource in AWS. The customer gateway device resides in a data center with a NAT gateway in front of it. What address should be used to create the customer gateway resource?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "52"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "B should be correct.https://docs.aws.amazon.com/AmazonS3/latest/dev/delete-or-empty-bucket.htmlYou can delete a bucket that contains objects using the AWS CLI only if the bucket does not have versioning enabled. If your bucket does not have versioning enabled, you can use the rb (remove bucket) AWS CLI command with --force parameter to remove a non-empty bucket."
				},
				"questionId": {
					"N": "643"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "The bucket has MFA Delete enabled, and the Administrator must turn it off."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "The bucket has versioning enabled, and the Administrator must permanently delete the objects' delete markers."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "The bucket is storing files in Amazon Glacier, and the Administrator must wait 3-5 hours for the files to delete. "
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "The bucket has server-side encryption enabled, and the Administrator must run the aws s3 rb s3:// my bucket -- sse command."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator attempting to delete an Amazon S3 bucket ran the following command: aws s3 rb s3://my bucket The command failed and bucket still exists. The administrator validated that no files existed in the bucket by running aws s3 1s s3://mybucket and getting an empty response. Why is the Administrator unable to delete the bucket, and what must be done to accomplish this task?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "53"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/usage-reports.html"
				},
				"questionId": {
					"N": "644"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "AWS Personal Health Dashboard"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "AWS Cost Explorer"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "AWS Service Catalog"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "AWS Application Discovery Service"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator must provide data to show the overall usage of Amazon EC2 instances within each department, and must determine if the purchased Reserved Instances are being used effectively. Which service should be used to provide the necessary information?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "54"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "http://jayendrapatil.com/aws-vpc-nat/"
				},
				"questionId": {
					"N": "645"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Add an internet gateway and update the route tables."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Add a NAT gateway to the VPC and update the route tables."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Add an interface endpoint and update the route tables."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Add a virtual gateway to the VPC and update the route tables."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company has multiple web applications running on Amazon EC2 instances in private subnets. The EC2 instances require connectivity to the internet for patching purposes, but cannot be publicly accessible. Which step will meet these requirements?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "55"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/what-is-cfnstacksets.html"
				},
				"questionId": {
					"N": "646"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create an AWS CloudFormation template defines the VPC. Log in to the AWS Management Console under each account and create a stack from the template."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create a shell script that configures the VPC using the AWS CLI. Provide a list of accounts to the script from a text file, then create the VPC in every account in the list."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create an AWS Lambda function that configures the VPC. Store the account information in Amazon DynamoDB, grant Lambda access to the DynamoDB table, then create the VPC in every account in the list."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create an AWS CloudFormation template that defines the VPC. Create an AWS CloudFormation StackSet based on the template, then deploy the template to all accounts using the stack set."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company has 50 AWS accounts and wants to create an identical Amazon VPC in each account. Any changes the company makes to the VPCs in the future must be implemented on every VPC. What is the SIMPLEST method to deploy and update the VPCs in each account?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "56"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "the change is in the network, so it is obvious that what need to be checked is Flow Log."
				},
				"questionId": {
					"N": "647"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "VPC Flow Logs"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Elastic Load Balancing logs"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Amazon CloudFront logs"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Amazon RDS MySQL error logs"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "After a network change, application servers cannot connect to the corresponding Amazon RDS MySQL database. What should the SysOps Administrator analyze?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "57"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "AWS Service Catalog provides a single location where organizations can centrally manage catalogs of IT services. With AWS Service Catalog you can control which IT services and versions are available, the configuration of the available services, and permission access by individual, group, department, or cost center."
				},
				"questionId": {
					"N": "648"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Set up an AWS Organization to create accounts for each department, and apply service control policies to control access to AWS services."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create IAM roles for each department, and set policies that grant access to specific AWS services."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use the AWS Service Catalog to create catalogs of AWS services that are approved for use by each department."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Request that each department create and manage its own AWS account and the resources within it."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company wants to ensure that each department operates within their own isolated environment, and they are only able to use pre-approved services.  How can this requirement be met?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "58"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "TotalErrorRate: The percentage of all requests for which the HTTP status code is 4xx or 5xx.The below are not available in CF:RejectedConnectionCountNetworkTransmitThroughputHealthyHostCount"
				},
				"questionId": {
					"N": "649"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "TotalErrorRate"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "RejectedConnectionCount"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "NetworkTransmitThroughput"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "HealthyHostCount"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is receiving multiple reports from customers that they are unable to connect to the company's website. which is being served through Amazon CloudFront. Customers are receiving HTTP response codes for both 4XX and 5XX errors. Which metric can the Administrator use to monitor the elevated error rates in CloudFront?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "59"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "Apply service control policies to the AWS Organizational Unit (OU) containing the production accounts to whitelist certified services. Apply a less restrictive policy to the OUs containing the development accounts."
				},
				"questionId": {
					"N": "650"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use AWS Config to shut down non-compliant services found within the production accounts on a periodic basis, while allowing these same services to run in the development accounts."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Apply service control policies to the AWS Organizational Unit (OU) containing the production accounts to whitelist certified services. Apply a less restrictive policy to the OUs containing the development accounts."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use IAM policies applied to the combination of user and account to prevent developers from using these services within the production accounts. Allow the services to run in development accounts."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use Amazon CloudWatch to report on the use of non-certified services within any account, triggering an AWS Lambda function to terminate only those non-certified services when found in a production account."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company is using AWS Organizations to manage all their accounts. The Chief Technology Officer wants to prevent certain services from being used within production accounts until the services have been internally certified. They are willing to allow developers to experiment with these uncertified services in development accounts but need a way to ensure that these services are not used within production accounts. Which option ensures that services are not allowed within the production accounts, yet are allowed in separate development accounts within the LEAST administrative overhead?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "60"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "AD"
				},
				"questionAnswerExplanation": {
					"S": "Not to be confused with Autoscale, This question is on load balancer"
				},
				"questionId": {
					"N": "651"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "The load balancer will continue to perform the health check on the EC2 instance."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "The EC2 instance will be terminated based on the health check failure."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "The EC2 instance will be rebooted."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "The load balancer will stop sending traffic to the EC2 instance."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "E"
								},
								"optionText": {
									"S": "A new EC2 instance will be deployed to replace the unhealthy instance."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator has configured health checks on a load balancer. An Amazon EC2 instance attached to this load balancer fails the health check. What will happen next? (Choose two.)"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "61"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "From my understanding insertLatency generates high CPU Usage, AuroraReplicaLag is the effect of the high CPU usage, not the cause. I would choose D"
				},
				"questionId": {
					"N": "652"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "FreeableMemory and DatabaseConnections to understand the amount of available RAM and number of connections to DB instance."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "FreeableMemory and EngineUptime to understand the amount of available RAM and the amount of time the instance has been up and running."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "DatabaseConnections and AuroraReplicaLag for the number of connections to the DB instance and the amount of lag when replicating updates from the primary instance."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "DatabaseConnections and InsertLatency for the number of connections to the DB instance and latency for insert queries."
								}
							}
						}
					]
				},
				"questionText": {
					"S": " An Application performs read-heavy operations on an Amazon Aurora DB instance. The SysOps Administrator monitors the CPUUtilization CloudWatch metric and has recently seen it increase to 90%. The Administrator would like to understand what is driving the CPU surge. Which of the following should be Administrator additionally monitor to understand the CPU surge?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "62"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "D is the MOST secure way of providing access. Providing the SSH key that was used while launching the instance, means providing root access. Its definitely not advisable to share the original keypair, and you also wouldn't be sure if the SysOps Admin would keep it safe. By creating an Administrative account, you can still restrict the access that is required by the admin (ALMOST full access but not root access), and storing the credentials in AWS Secrets Manger would ensure that they are safe and secure."
				},
				"questionId": {
					"N": "653"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Assign the same IAM role to the Administrator that is assigned to the bastion host."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Provide the Administrator with the SSH key that was used for the bastion host when it was originally launched."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create a new IAM role with the same permissions as the Security team, and assign it to the Administrator."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create a new administrative account on the bastion host, and provide those credentials to the Administrator using AWS Secrets Manager."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator must use a bastion host to administer a fleet of Amazon EC2 instances. All access to the bastion host is managed by the Security team. What is the MOST secure way for the Security team to provide the SysOps Administrator access to the bastion host?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "63"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "You can only enable encryption for an Amazon RDS DB instance when you create it, not after the DB instance is created.However, because you can encrypt a copy of an unencrypted DB snapshot, you can effectively add encryption to an unencrypted DB instance. That is, you can create a snapshot of your DB instance, and then create an encrypted copy of that snapshot. You can then restore a DB instance from the encrypted snapshot, and thus you have an encrypted copy of your original DB instance."
				},
				"questionId": {
					"N": "654"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Log in to the RDS console and select the encryption box to encrypt the database."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create a new encrypted Amazon EBS volume and attach it to the instance."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Encrypt the standby replica in the secondary Availability Zone and promote it to the primary instance."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Take a snapshot of the RDS instance, copy and encrypt the snapshot, and then restore to the new RDS instance."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A database is running on an Amazon RDS Multi-AZ DB instance. A recent security audit found the database to be out of compliance because it was not encrypted. Which approach will resolve the encryption requirement?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "64"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "As said, the flow log is enabled on SMTP interface, and the flow log information is showing destination port (25), with rejected message. That means, the packet is generated by the EC2, and captured by the security group and rejected, because it is not added to the allowed list of the SMTP security Group.Solution is to add the EC2 IP to the security group of the SMTP server."
				},
				"questionId": {
					"N": "655"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Add the instance to the security group for the SMTP server and ensure that is permitted to communicate over TCP port 25."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Disable the iptables service on the SMTP server so that the instance can properly communicate over the network."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Install an email client on the instance to ensure that it communicates correctly on TCP port 25 to the  SMTP server."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Add a rule to the security group for the instance to explicitly permit TCP port 25 outbound to any address."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An Amazon EC2 instance is unable to connect an SMTP server in a different subnet. Other instances are successfully communicating with the SMTP server, however VPC Flow Logs have been enabled on the SMTP server's network interface and show the following information: 2 223342798652 eni-abe77dab 10.1.1.200 10.100.1.10 1123 25 17 70 48252 1515534437 1515535037 REJECT OK What can be done to correct this problem?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "65"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "Set up daily Cost and Usage Report and download the output from Amazon S3."
				},
				"questionId": {
					"N": "656"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Share the monthly AWS bill with management."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Use AWS CloudTrail Logs to access daily costs in JSON format."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Set up a daily Cost and Usage Report and download the output from Amazon S3."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Monitor AWS costs with Amazon CloudWatch and create billing alerts and notifications."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company's use of AWS Cloud services is quickly growing, so a SysOps Administrator has been asked to generate details of daily spending to share with management. Which method should the Administrator choose to produce this data?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "66"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": " Because it needs to be shared with the security teams ACCOUNT. Which can be done via a bucket acl https://docs.aws.amazon.com/kms/latest/developerguide/logging-using-cloudtrail.html"
				},
				"questionId": {
					"N": "657"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create an AWS Lambda function that will run every few minutes in each production account, parse the KMS log for KMS events, and sent the information to an Amazon SQS queue managed by the Security team."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create an event bus in the Security team's account, create a new Amazon CloudWatch Events rule that matches the KMS events in each production account, and then add the Security team's event bus as the target."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Set up AWS CloudTrail for KMS events in every production account, and have the logs sent to an Amazon S3 bucket that is managed by the Security team."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create an AWS Config rule that checks for KMS keys that are in a pending deletion or rotated state in every production account, then send Amazon SNS notifications of any non-compliant KMS resources to the Security team."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company's Security team wants to track data encryption events across all company AWS accounts. The team wants to capture all AWS KMS events related to deleting or rotating customer master keys (CMKs) from all production AWS accounts. The KMS events will be sent to the Security team's AWS account for monitoring. How can this be accomplished?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "67"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "https://aws.amazon.com/security/penetration-testing/Effective immediately, AWS customers are welcome to carry out security assessments or penetration tests against their AWS infrastructure without prior approval for 8 services."
				},
				"questionId": {
					"N": "658"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "The existing nightly scan can continue with a few changes. The external testing company must be notified of the new IP address of the workload and the security group of the workload must be modified to allow scans from the external company's IP range."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "If the external company is a vendor in the AWS Marketplace, notify them of the new IP address of the workload."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Submit a penetration testing request every 90 days and have the external company test externally when the request is approved."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "AWS performs vulnerability testing behind the scenes daily and patches instances as needed. If a vulnerability cannot be automatically addressed, a notification email is distributed."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A workload has been moved from a data center to AWS. Previously, vulnerability scans were performed nightly by an external testing company. There is a mandate to continue the vulnerability scans in the AWS environment with third-party testing occurring at least once each month. What solution allows the vulnerability scans to continue without violating the AWS Acceptable Use Policy?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "68"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "as the object is placed by account A - Lambda into Account B then the bucket B do not have enough permission to delete objects for A.Therefore, it is required to allow the BUCKET OWNER B to be able to delete his / her own bucket 's object! so, account A, should provide this permission by the said command (S3:PutObjectAcl)"
				},
				"questionId": {
					"N": "659"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Add s3:DeleteObject permission to the IAM execution role of the AWS Lambda function in Account A."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Change the bucket policy of the S3 bucket in Account B to allow s3:DeleteObject permission for Account A."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Disable server-side encryption for objects written to the S3 bucket by the Lambda function."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Call the S3:PutObjectAcl API operation from the Lambda function in Account A to specify bucket owner, full control."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is writing a utility that publishes resources from an AWS Lambda function in AWS Account A to an Amazon S3 bucket in AWS Account B. The Lambda function is able to successfully write new objects to the S3 bucket, but IAM users in Account B are unable to delete objects written to the bucket by Account A.  Which step will fix this issue?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "69"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/UsingAlarmActions.html"
				},
				"questionId": {
					"N": "660"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Configure the alarm to send emails to subscribers using Amazon SES."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Configure the alarm to send emails to subscribers using Amazon SNS."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Configure the alarm to send emails to subscribers using Amazon Inspector."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Configure the alarm to send emails to subscribers using Amazon Cognito."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An organization would like to set up an option for its Developers to receive an email whenever production Amazon EC2 instances are running over 80% CPU utilization. How can this be accomplished using an Amazon CloudWatch alarm?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "70"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "BC"
				},
				"questionAnswerExplanation": {
					"S": "In IAM, you create one or more IAM roles. In the role's trust policy, you set the SAML provider as the principal, which establishes a trust relationship between your organization and AWS."
				},
				"questionId": {
					"N": "661"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create IAM users for each identity provider (IdP) user to allow access to the AWS environment."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Define assertions that map the company's identity provider (IdP) users to IAM roles."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create IAM roles with a trust policy that lists the SAML provider as the principal."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create IAM users, place them in a group named SAML, and grant them necessary IAM permissions."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "E"
								},
								"optionText": {
									"S": "Grant identity provider (IdP) users the necessary IAM permissions to be able to log in to the AWS environment."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "Which of the following steps are required to configure SAML 2.0 for federated access to AWS? (Choose two.)"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "71"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "0.0.0.0/0"
				},
				"questionId": {
					"N": "662"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "0.0.0.0/0 IGW"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "0.0.0.0/0 NAT "
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "10.0.1.0/24 IGW"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "10.0.1.0/24 NAT"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is attempting to download patches from the internet into an instance in a private subnet. An internet gateway exists for the VPC, and a NAT gateway has been deployed on the public subnet; however, the instance has no internet connectivity. The resources deployed into the private subnet must be inaccessible directly from the public internet. What should be added to the private subnet's route table in order to address this issue, given the information provided."
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "72"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "https://aws.amazon.com/premiumsupport/technology/personal-health-dashboard/ PHD provides proactive notification to help you plan for scheduled activities"
				},
				"questionId": {
					"N": "663"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Monitor AWS CloudTrail for StopInstances API calls related to upcoming maintenance."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Review the Personal Health Dashboard for any scheduled maintenance."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "From the AWS Management Console, list any instances with failed system status checks."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Deploy a third-party monitoring solution to provide real-time EC2 instance monitoring."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is responsible for a large fleet of EC2 instances and must know whether any instances will be affected by upcoming hardware maintenance. Which option would provide this information with the LEAST administrative overhead?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "73"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/efs/latest/ug/efs-enforce-encryption.html"
				},
				"questionId": {
					"N": "664"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Enable encryption on each host's connection to the Amazon EFS volume. Each connection must be recreated for encryption to take effect."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Enable encryption on the existing EFS volume by using the AWS Command Line Interface."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Enable encryption on each host's local drive. Restart each host to encrypt the drive."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Enable encryption on a newly created volume and copy all data from the original volume. Reconnect each host to the new volume."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An organization created an Amazon Elastic File System (Amazon EFS) volume with a file system ID of fs- 85ba41fc, and it is actively used by 10 Amazon EC2 hosts. The organization has become concerned that the file system is not encrypted. How can this be resolved?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "74"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "https://aws.amazon.com/ebs/features/"
				},
				"questionId": {
					"N": "665"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create a snapshot and restore it to a larger gp2 volume."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create a RAID 0 with another new gp2 volume to increase capacity."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Leverage the Elastic Volumes feature of EBS to increase gp2 volume size."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Write a script to migrate data to a larger gp2 volume."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An organization finds that a high number of gp2 Amazon EBS volumes are running out of space. Which solution will provide the LEAST disruption with MINIMAL effort?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "75"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "Spot blocks allow you to request Amazon EC2 Spot instances for 1 to 6 hours at a time to avoid being interrupted while your job completes"
				},
				"questionId": {
					"N": "666"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use a mixture of On-Demand and Spot Instances for job execution."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Submit a request for a Spot block to be used for job execution."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Purchase Reserved Instances to be used for job execution."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Submit a request for a one-time Spot Instance for job execution."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An e-commerce company wants to lower costs on its nightly jobs that aggregate the current day's sales and store the results in Amazon S3. The jobs are currently run using multiple on-demand instances and the jobs take just under 2 hours to complete. If a job fails for any reason, it needs to be restarted from the beginning. What method is the MOST cost effective based on these requirements?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "76"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "AMIs are a regional resource. Therefore, sharing an AMI makes it available in that region. To make an AMI available in a different region, copy the AMI to the region and then share it. For more information, see Copying an AMI."
				},
				"questionId": {
					"N": "667"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create an encrypted Amazon Machine Image (AMI) of the instance and make it public to allow the other account to search and launch an instance from it."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create an AMI of the instance, add permissions for the AMI to the other AWS account, and start a new instance in the new region by using that AMI."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create an AMI of the instance, copy the AMI to the new region, add permissions for the AMI to the other AWS account, and start new instance."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create an encrypted snapshot of the instance and make it public. Provide only permissions to decrypt to the other AWS account."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An existing data management application is running on a single Amazon EC2 instance and needs to be moved to a new AWS Region in another AWS account. How can a SysOps Administrator achieve this while maintaining the security of the application? "
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "77"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AmazonS3/latest/dev/bucket-encryption.html Amazon S3 default encryption provides a way to set the default encryption behavior for an S3 bucket. You can set default encryption on a bucket so that all new objects are encrypted when they are stored in the bucket. The objects are encrypted using server-side encryption with either Amazon S3-managed keys (SSE-S3) or customer master keys (CMKs) stored in AWS Key Management Service (AWS KMS).C630"
				},
				"questionId": {
					"N": "668"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create an S3 lifecycle rule to automatically encrypt all new objects."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Enable default bucket encryption to ensure that all new objects are encrypted."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use put-object-acl to allow objects to be encrypted with S2 server-side encryption."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Apply the authorization header to S3 requests for S3 server-side encryption."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator manages an application that stores object metadata in Amazon S3. There is a requirement to have S2 server-side encryption enabled on all new objects in the bucket. How can the Administrator ensure that all new objects to the bucket satisfy this requirement?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "78"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "When you import key material into a CMK, the CMK is permanently associated with that key material. You can reimport the same key material, but you cannot import different key material into that CMK. Also, you cannot enable automatic key rotation for a CMK with imported key material. However, you can manually rotate a CMK with imported key material.https://docs.aws.amazon.com/kms/latest/developerguide/importing-keys.html"
				},
				"questionId": {
					"N": "669"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Enable automatic key rotation for the CMK, and specify a period of 6 months."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create a new CMK with new imported material, and update the key alias to point to the new CMK."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Delete the current key material, and import new material into the existing CMK."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Import a copy of the existing key material into a new CMK as a backup, and set the rotation schedule for 6 months."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company is using an AWS KMS customer master key (CMK) with imported key material. The company references the CMK by its alias in the Java application to encrypt data. The CMK must be rotated every 6 months. What is the process to rotate the key?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "79"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "https://aws.amazon.com/blogs/security/amazon-inspector-assess-network-exposure-ec2-instances-aws-network-reachability-assessments/c check only SSH"
				},
				"questionId": {
					"N": "670"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Enable AWS Trusted Advisor and show the Security team that the Security Groups unrestricted access check will alarm."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Schedule an AWS Lambda function to run hourly to scan and evaluate all security groups, and send a report to the Security team."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use AWS Config to enable the restricted-common-ports rule, and add port 80 to the parameters."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use Amazon Inspector to evaluate the security groups during scans, and send the completed reports to the Security team."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "The Security team has decided that there will be no public internet access to HTTP (TCP port 80) because it is moving to HTTPS for all incoming web traffic. The team has asked a SysOps Administrator to provide a report on any security groups that are not compliant. What should the SysOps Administrator do to provide near real-time compliance reporting?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "80"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "Text Widget' is of type 'text' and not 'metric'. It is sort of creating a text/label/description for your dashboard. You cannot select any metric in a text widget, so the second part (select the appropriate metric from the custom namespace) in option B makes it a wrong statement.In option C they are asking you to select the appropriate widget, which basically assumes that you wont select a Text widget.https: //docs.aws.amazon.com/AmazonCloudWatch/latest/APIReference/CloudWatch-Dashboard-Body-Structure.html#CloudWatch-Dashboard-Properties-Text-Widget-Object"
				},
				"questionId": {
					"N": "671"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Select the AWS Namespace, filter by metric name, then add to the dashboard. "
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Add a text widget, select the appropriate metric from the custom namespace, then add to the dashboard."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Select the appropriate widget and metrics from the custom namespace, then add to the dashboard."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Open the CloudWatch console, from the CloudWatch Events, add all custom metrics."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator has configured a CloudWatch agent to send custom metrics to Amazon CloudWatch and is now assembling a CloudWatch dashboard to display these metrics. What steps should the Administrator take to complete this task?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "81"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "AD"
				},
				"questionAnswerExplanation": {
					"S": "NAT Gateway itself is present inside Public subnet, and all traffic coming from Private subnet is routed to NAT (which is in the Public subnet) for secure outbound internet traffic; answer is A and D."
				},
				"questionId": {
					"N": "672"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Set up a bastion host in a public subnet, and configure security groups and route tables accordingly."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Set up a bastion host in the private subnet, and configure security groups accordingly."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Configure a load balancer in a public subnet, and configure the route tables accordingly."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Set up a NAT gateway in a public subnet, and change the private subnet route tables accordingly."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "E"
								},
								"optionText": {
									"S": "Set up a NAT gateway in a private subnet, and ensure that the route tables are configured accordingly."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An application is running on multiple EC2 instances. As part of an initiative to improve overall infrastructure security, the EC2 instances were moved to a private subnet. However, since moving, the EC2 instances have not been able to automatically update, and a SysOps Administrator has not been able to SSH into them remotely. Which two actions could the Administrator take to securely resolve these issues? (Choose two.)"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "82"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "For A: If you want to use same teplate with multiple envt with Little changes especially Input or map or condition related then, A is good For B : If you dont want to change anything in your template and if requires simply to run any envt without changes then, B is the right one."
				},
				"questionId": {
					"N": "673"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use parameters to provision the resources."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Use nested stacks to provision the resources."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use Amazon EC2 user data to provision the resources."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use stack policies to provision the resources."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator has been tasked with deploying a company's infrastructure as code. The Administrator wants to write a single template that can be reused for multiple environments in a safe, repeatable manner. What is the recommended way to use AWS CloudFormation to meet this requirement?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "83"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "If there are multiple subnets in an Availability Zone in your VPC, you create a mount target in one of the subnets.Then all EC2 instances in that Availability Zone share that mount target. and B says Create mount targets in multiple subnets "
				},
				"questionId": {
					"N": "674"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Connect a large Amazon EBS volume to multiple instances and schedule snapshots."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Deploy Amazon EFS is in the VPC and create mount targets in multiple subnets."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Launch an EC2 instance and share data using SMB/CIFS or NFS."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Deploy an AWS Storage Gateway cached volume on Amazon EC2."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An application accesses data through a file system interface. The application runs on Amazon EC2 instances in multiple Availability Zones, all of which must share the same data. While the amount of data is currently small, the company anticipates that it will grow to tens of terabytes over the lifetime of the application. What is the MOST scalable storage solution to fulfill the requirement?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "84"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "CE"
				},
				"questionAnswerExplanation": {
					"S": "C - Only this option addresses tagging of 'existing' resources. Existing resources will also contribute to the future costs, so tagging them appropriately is very important. However, I don't understand why it is required to run this week, unless it is also going to automatically tag new resources.E - Absolutely required to create budget alarms and send notifications. It also has a dependency on tagging new and existing resources (option C), in order to send the notifications at the right time."
				},
				"questionId": {
					"N": "675"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use AWS Trusted Advisor to obtain a report containing the checked items in the Cost Optimization pillar."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Download the detailed billing report, upload it to a database, and match the line items with a list of known resources by department. "
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create a script by using the AWS CLI to automatically apply tags to existing resources to each department. Schedule the script to run weekly."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use AWS Organizations to create a department Organizational Unit and allow only authorized personnel in each department to create resources."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "E"
								},
								"optionText": {
									"S": "Create a Budget from the Billing and Cost Management console. Specify the budget type a Cost, assign tags for each department, define notifications, and specify any other options as required."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company has Sales department and Marketing department. The company uses one AWS account. There is a need to determine what charges are incurred on the AWS platform by each department. There is also a need to receive notifications when a specified cost level is approached or exceeded. Which two actions must a SysOps Administrator take to achieve both requirements with the LEAST amount of administrative overhead? (Choose two.)"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "85"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "Imagine if you have 1000 developers ? Am I going to create 1000 users ??? Letter D is the correct option"
				},
				"questionId": {
					"N": "676"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create an AWS Lambda function with an IAM role attached to it that has access to both accounts' S3 buckets. Pull the logs from the production S3 bucket to the development S3 bucket."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create IAM users for each Developer on the production account, and add the Developers to an IAM group that provides read-only access to the S3 log bucket."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create an Amazon EC2 bastion host with an IAM role attached to it that has access to the production S3 log bucket, and then provision access for the Developers on the host."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create a resource-based policy for the S3 bucket on the production account that grants access to the development account, and then delegate access in the development account."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company has two AWS accounts: development and production. All applications send logs to a specific Amazon S3 bucket for each account, and the Developers are requesting access to the production account S3 buckets to view the logs. Which is the MOST efficient way to provide the Developers with access?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "86"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "When using VPC with S3, use VPC S3 endpoints as are horizontally scaled, redundant, and highly available VPC components help establish a private connection between VPC and S3 and the traffic never leaves the Amazon network"
				},
				"questionId": {
					"N": "677"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Security groups"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "NAT gateways"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Virtual private gateway"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Gateway VPC endpoints"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company's application stores documents within an Amazon S3 bucket. The application is running on Amazon EC2 in a VPC. A recent change in security requirements states that traffic between the company's application and the S3 bucket must never leave the Amazon network. What AWS feature can provide this functionality?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "87"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": " Suspend the scaling process before troubleshooting."
				},
				"questionId": {
					"N": "678"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Suspend the scaling process before troubleshooting."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Delete the Auto Scaling group and recreate it when troubleshooting is complete."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Remove impacted instances from the Classic Load Balancer."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create a scale down trigger when the CPUUtilization instance metric is at 70%."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is running an auto-scaled application behind a Classic Load Balancer. Scaling out is triggered when the CPUUtilization instance metric is more than 75% across the Auto Scaling group. The Administrator noticed aggressive scaling out and after discussing with developers, an application memory leak is suspected causing aggressive garbage collection cycle. How can the Administrator troubleshoot the application without triggering the scaling process?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "88"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "You might need to shutdown or reboot your VM for maintenance, such as when applying a patch to your hypervisor. Before you shutdown the VM, you must first stop the gateway. For file gateway, you just shutdown your VM. Although this section focuses on starting and stopping your gateway using the AWS Storage Gateway Management Console, you can also and stop your gateway by using your VM local console or AWS Storage Gateway API. When you power on your VM, remember to restart your gateway."
				},
				"questionId": {
					"N": "679"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Stop Storage Gateway and reboot the virtual machine, then restart Storage Gateway."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Reboot the virtual machine, then restart Storage Gateway. "
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Reboot the virtual machine."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Shut down the virtual machine and stop Storage Gateway, then turn on the virtual machine."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company backs up data from its data center using a tape gateway on AWS Storage Gateway. The SysOps Administrator needs to reboot the virtual machine running Storage Gateway. What process will protect data integrity?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "89"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "if the data transfer would take more than a week then it is more efficient to use Snowball (for 70TB). The 150MB, with full speed (using the maximum Acceleration on the world) requires around ~43 days 5 hours 2 minutes to transfer the 70TB to AWS. Then this is a waste of time, resources, and could be more expensive than snowball (taking into consideration that the 10 people can not use the 150MB as it is busy uploading). Storage gateway, is not meant for such a single time archiving.direct connect, is too expensive for such one time job. So, definitely the answer is A."
				},
				"questionId": {
					"N": "680"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "AWS Snowball"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "AWS Direct Connect"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "AWS Storage Gateway"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Amazon S3 Transfer Acceleration"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An organization has decided to consolidate storage and move all of its backups and archives to Amazon S3. With all of the data gathered into a hierarchy under a single directory, the organization determines there is 70 TB of data that needs to be uploaded. The organization currently has a 150-Mbps connection with 10 people working at the location. Which service would be the MOST efficient way to transfer this data to Amazon S3?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "90"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "You cannot attach a WAF web ACL directly to a Classic Load Balancer as this is not supported. I would recommend migrating to the Application Load Balancer and attaching WAF to the Application Load Balancer. Alternatively you could create a CloudFront distribution that uses the Classic Load Balancer as the origin and then attach WAF to CloudFront https://forums.aws.amazon.com/thread.jspa?messageID=900985"
				},
				"questionId": {
					"N": "681"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Configure Amazon GuardDuty to monitor the application for SQL injection threats."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Configure AWS WAF with a Classic Load Balancer for protection against SQL injection attacks."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Replace the Classic Load Balancer with an Application Load Balancer and configure AWS WAF on the Application Load Balancer."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Configure an Amazon CloudFront distribution with the Classic Load Balancer as the origin and subscribe to AWS Shield Standard."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is deploying a legacy web application on AWS. The application has four Amazon EC2 instances behind a Classic Load Balancer and stores data in an Amazon RDS instance. The legacy application has known vulnerabilities to SQL injection attacks, but the application code is no longer available to update. What cost-effective configuration change should the Administrator make to mitigate the risk of SQL injection attacks?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "91"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "C. Install and configure the unified CloudWatch agent."
				},
				"questionId": {
					"N": "682"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Configure AWS Config to forward events to CloudWatch."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Configure a Simple Network Management Protocol (SNMP) agent to forward events to CloudWatch."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Install and configure the unified CloudWatch agent."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Install and configure the Amazon Inspector agent."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A fleet of servers must send local logs to Amazon CloudWatch. How should the servers be configured to meet this requirement?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "92"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "DE"
				},
				"questionAnswerExplanation": {
					"S": "https://aws.amazon.com/compliance/shared-responsibility-model/"
				},
				"questionId": {
					"N": "683"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Patching the guest operating system"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Monitoring memory utilization"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Configuring network ACLs"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Patching the hypervisor"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "E"
								},
								"optionText": {
									"S": "Maintaining network infrastructure"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "According to the shared responsibility model, for which of the following Amazon EC2 activities is AWS responsible? (Choose two.)"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "93"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "When you enable log file integrity validation, CloudTrail creates a hash for every log file that it delivers. Every hour, CloudTrail also creates and delivers a file that references the log files for the last hour and contains a hash of each. This file is called a digest file. CloudTrail signs each digest file using the private key of a public and private key pair. After delivery, you can use the public key to validate the digest file. CloudTrail uses different key pairs for each AWS region"
				},
				"questionId": {
					"N": "684"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Stream the CloudTrail logs to Amazon CloudWatch Logs to store logs at a secondary location."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Enable log file integrity validation and use digest files to verify the hash value of the log file."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Replicate the S3 log bucket across regions, and encrypt log files with S3 managed keys."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Enable S3 server access logging to track requests made to the log bucket for security audits."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company monitors its account activity using AWS CloudTrail, and is concerned that some log files are  being tampered with after the logs have been delivered to the account's Amazon S3 bucket. Moving forward, how can the SysOps Administrator confirm that the log files have not been modified after being delivered to the S3 bucket."
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "94"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "https://aws.amazon.com/premiumsupport/knowledge-center/ec2rescue-windows-troubleshoot/"
				},
				"questionId": {
					"N": "685"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use AWS Trusted Advisor to gather operating system log files for analysis."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Use VPC Flow Logs to gather operating system log files for analysis."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use EC2Rescue to gather operating system log files for analysis."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use Amazon Inspector to gather operating system log files for analysis."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "After launching a new Amazon EC2 instance from a Microsoft Windows 2012 Amazon Machine Image (AMI), the SysOps Administrator is unable to connect to the instance using Remote Desktop Protocol (RDP). The instance is also unreachable. As part of troubleshooting, the Administrator deploys a second instance from a different AMI using the same configuration and is able to connect to the instance. What should be the next logical step in troubleshooting the first instance?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "95"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "Good point. I was almost tempted to say that D was the right answer. CodePipeline can be triggered if there are updates to the application code, but not when new EC2 instances are launched.The only way to deploy the application on new instances is through User Data.I agree A is the most appropriate answer in this case."
				},
				"questionId": {
					"N": "686"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Launch a script that downloads and installs the application using the Amazon EC2 user data."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create a custom API using Amazon API Gateway to call an installation executable from an AWS CloudFormation Template."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use AWS Systems Manager to inject the application into an AMI."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Configure AWS CodePipeline to deploy code changes and updates."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A custom application must be installed on all Amazon EC2 instances. The application is small, updated frequently and can be installed automatically. How can the application be deployed on new EC2 instances?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "96"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "AE"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AmazonCloudFront/latest/DeveloperGuide/cache-hit-ratio.html#cache-hit-ratio-http-streaming"
				},
				"questionId": {
					"N": "687"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Ensure that only required cookies, query strings, and headers are forwarded in the Cache Behavior Settings"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Change the Viewer Protocol Policy to use HTTPS only"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Configure the distribution to use presigned cookies and URLs to restrict access to the distribution"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Enable automatic compression of objects in the Cache Behavior Settings"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "E"
								},
								"optionText": {
									"S": "Increase the CloudFront time to live (TTL) settings in the Cache Behavior Settings"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator noticed that the cache hit ratio for an Amazon CloudFront distribution is less than 10%. Which collection of configuration changes will increase the cache hit ratio for the distribution? (Choose two.)"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "97"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/amazonglacier/latest/dev/vault-lock.html Vault lock will ensure that the data is never changed - Write once read many."
				},
				"questionId": {
					"N": "688"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Upload the file to Amazon S3 through the AWS Management Console and apply a lifecycle policy to change the storage class to Amazon Glacier."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Upload the archive to the Amazon Glacier with the AWS CLI and enable Vault Lock."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create a Linux EC2 instance with an encrypted Amazon EBS volume and copy each weekly archive file for this instance."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create a file gateway attached to a file share on an S3 bucket with the storage class S3 Infrequent Access. Upload the archives via the gateway."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "On a weekly basis, the Administrator for a photo sharing website receives an archive of all files users have uploaded the previous week. these file archives can be as large as 10TB in size. For legal reasons, these archives must be saved with no possibility of someone deleting or modifying these archives. Occasionally, there may be a need to view the contents, but it is expected that retrieving them can take three or more hours. What should the Administrator do with the weekly archive? "
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "98"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "https://forums.aws.amazon.com/thread.jspa?threadID=194986 If you are using memcached engine, you can add additional nodes to your cluster to increase the total cache size. If you want to use bigger instance type, you will have to launch a new cache cluster and make your application to start using it."
				},
				"questionId": {
					"N": "689"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "use the ModifyCacheCluster API and specify a new CacheNodeType"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "use the CreateCacheCluster API and specify a new CacheNodeType"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "use the ModifyCacheParameterGroup API and specify a new CacheNodeType"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "use the RebootCacheCluster API and specify a new CacheNodeType"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is managing a Memcached cluster in Amazon ElastiCache. The cluster has been heavily used recently, and the Administrator wants to use a larger instance type with more memory. What should the Administrator use to make this change?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "99"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "Stackset is a container for AWS cloudformation stacks that lets you provision stacks across AWS accounts and regions by using a single AWS cloudformation template."
				},
				"questionId": {
					"N": "690"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create a CloudFormation stack set, then select the CloudFormation template and use it to configure the AWS accounts"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Write a script that iterates over the company's AWS accounts and executes the CloudFormation template in each account"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use AWS Organizations to execute the CloudFormation template in all accounts"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create a CloudFormation stack in the master account of AWS Organizations and execute the CloudFormation template to create AWS Config rules in all accounts"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company with dozens of AWS accounts wants to ensure that governance rules are being applied across all accounts. The CIO has recommended that AWS Config rules be deployed using an AWS CloudFormation template. How should these requirements be met?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "100"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "The PCI DSS Attestation of Compliance (AOC) and Responsibility Summary is available to customers by using AWS Artifact, a self-service portal for on-demand access to AWS compliance reports."
				},
				"questionId": {
					"N": "691"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "AWS Macie"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "AWS Artifact"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "AWS OpsWorks"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "AWS Organizations"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company's Information Security team has requested information on AWS environment compliance for Payment Card Industry (PCI) workloads. They have requested assistance in understanding what specific areas of the PCI standards are the responsibility of the company. Which AWS tool will provide the necessary information?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "101"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/US_AlarmAtThresholdEC2.html"
				},
				"questionId": {
					"N": "692"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use the set-alarm-state command in AWS CloudTrail to invoke the Amazon SNS notification"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Use CloudWatch custom metrics to set the alarm state in AWS CloudTrail and enable Amazon SNS notifications"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use EC2 instance metadata to manually set the CPU utilization to 75% and invoke the alarm state"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use the set-alarm-state command in the AWS CLI for CloudWatch"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company has deployed a fleet of Amazon EC2 web servers for the upcoming release of a new product. The SysOps Administrator needs to test the Amazon CloudWatch notification settings for this deployment to ensure that a notification is sent using Amazon SNS if the CPU utilization of an EC2 instance exceeds 70%. How should the Administrator accomplish this?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "102"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "A is the right answer, since AMI IDs are unique across regions."
				},
				"questionId": {
					"N": "693"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "The AMI ID must be updated for the us-west-1 region in the Lambda function as well"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "The Lambda function can only launch EC2 instances in the same region where it is deployed"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "The Lambda function does not have the necessary IAM permission to launch more than one EC2 instance"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "The instance type defined in the Lambda function is not available in the us-west-1 region"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator has written an AWS Lambda function to launch new Amazon EC2 instances and deployed it in the us-east-1 region. The Administrator tested it by launching a new t2.nano instance in the us-east-1 region and it performed as expected. However, when the region name was updated in the Lambda function to launch an EC2 instance in the us-west-1 region, it failed. What is causing this error?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "103"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": " should be correct as free disk space is not a built-in matrix for cloudwatch C: https://blog.justinworrell.com/2017/09/30/monitoring-free-disk-space-on-a-windows-ec2-instance-with-cloudwatch/"
				},
				"questionId": {
					"N": "694"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use built-in Amazon CloudWatch metrics, and configure CloudWatch alarms and an Amazon SNS topic for email notifications"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Use AWS CloudTrail logs and configure the trail to send notifications to an Amazon SNS topic"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use the Amazon CloudWatch agent to send disk space metrics, then set up CloudWatch alarms using an Amazon SNS topic"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use AWS Trusted Advisor and enable email notification alerts for EC2 disk space"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is required to monitor free space on Amazon EBS volumes attached to Microsoft Windows-based Amazon EC2 instances within a company's account. The Administrator must be alerted to potential issues. What should the Administrator do to receive email alerts before low storage space affects EC2 instance performance?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "104"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "https://aws.amazon.com/premiumsupport/knowledge-center/accidental-termination/"
				},
				"questionId": {
					"N": "695"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use AWS Systems Manager to restrict EC2 termination"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Use AWS Config to restrict EC2 termination"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Apply Amazon CloudWatch Events to prevent EC2 termination"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Enable termination protection on EC2 instances"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator wants to prevent Developers from accidentally terminating Amazon EC2 instances. How can this be accomplished?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "105"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "Amazon EC2 DescribeInstances action in the us-east-1 Region"
				},
				"questionId": {
					"N": "696"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Amazon RDS DescribeDBInstances action in the us-east-1 Region"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Amazon S3 PutObject operation in a bucket named testbucket"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Amazon EC2 DescribeInstances action in the us-east-1 Region"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Amazon EC2 AttachNetworkInterface action in the eu-west-1 Region"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company has attached the following policy to an IAM user.  Which of the following actions are allowed for the IAM user?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "106"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "D is correct: Requesting a Limit Increase"
				},
				"questionId": {
					"N": "697"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use Amazon Inspector to trigger an alert when the limits are exceeded"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Use the AWS CLI to bypass the limits placed on the account"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Sign in to the AWS Management Console and adjust the limit values to launch new resources"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Open a case with AWS Support requesting an increase of the EC2 instance limit"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator launched an Amazon EC2 instance and received a message that the service limit was exceeded for that instance type. What action should the Administrator take to ensure that EC2 instances can be launched?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "107"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "https://aws.amazon.com/premiumsupport/knowledge-center/auto-scaling-terminate-instance/If an instance's status is OutofService on the ELB console, but the instance's status is Healthy on the Amazon EC2 Auto Scaling console, confirm that the health check type is set to ELB:"
				},
				"questionId": {
					"N": "698"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "The health check grace period for the Auto Scaling group is set too low; increase it"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "The target group health check is incorrectly configured and needs to be adjusted"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "The user data or AMI used for the Auto Scaling group launch configuration is incorrect"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "The Auto Scaling group health check type is based on EC2 instance health instead of Elastic Load Balancing health checks"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A web application runs on Amazon EC2 instances behind an Elastic Load Balancing Application Load Balancer (ALB). The instances run in an Auto Scaling group across multiple Availability Zones. A SysOps Administrator has notice that some EC2 instances show up healthy in the Auto Scaling console but show up as unhealthy in the ALB target console. What could be the issue?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "108"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "True. Through cloudwatch, Ec2 can be restarted, stopped , started."
				},
				"questionId": {
					"N": "699"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Amazon EC2 Systems Manager"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Amazon Inspector"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "AWS CloudFormation"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Amazon CloudWatch"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company is running critical applications on Amazon EC2 instances. The company needs to ensure its resources are automatically recovered if they become impaired due to an underlying hardware failure. Which service can be used to monitor and recover the EC2 instances?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "109"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "https://awsinsider.net/articles/2017/06/12/ec2-placement-groups.aspx"
				},
				"questionId": {
					"N": "700"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "a dedicated VPC."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "a single subnet inside the VPC."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "a placement group."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "a single Availability Zone."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A gaming application is deployed on four Amazon EC2 instances in a default VPC. The SysOps Administrator has noticed consistently high latency in responses as data is transferred among the four instances. There is no way for the Administrator to alter the application code. The MOST effective way to reduce latency is to relaunch the EC2 instances in:"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "110"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "ELB can be configured to use sticky session feature (also called session affinity) which enables it to bind a user's session to an instance and ensures all requests are sent to the same instance.Stickiness remains for a period of time which can be controlled by the application's session cookie, if one exists, or through cookie, named AWSELB, created through Elastic Load balancer.Sticky sessions for ELB are disabled, by default."
				},
				"questionId": {
					"N": "701"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "ELB TCP listeners"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "ELB sticky sessions "
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "ELB connection draining"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "ELB cross-zone load balancing"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company has created an online retail application that is hosted on a fleet of Amazon EC2 instances behind an ELB Application Load Balancer. User authentication is handled at the individual EC2 instance level. Once a user is authenticated; all requests from that user must go to the same EC2 instance. What should the SysOps Administrator enable to meet these requirements?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "111"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "Only Amazon can alias their AMIhttps://docs.aws.amazon.com/AWSEC2/latest/UserGuide/sharing-amis.html"
				},
				"questionId": {
					"N": "702"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Amazon SNS cannot be triggered from the AWS Personal Health Dashboard"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "The AWS Personal Health Dashboard only reports events from one account, not linked accounts."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "The AWS Personal Health Dashboard must be configured from the payer account only; all events will then roll up into the payer account."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "AWS Organizations must be used to monitor linked accounts."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOpsAdministrator is managing a large organization with multiple accounts on the Business Support plan all linked to a single payer account. The Administrator wants to be notified automatically of AWS Personal Health Dashboard events. In the main payer account, the Administrator configures Amazon CloudWatch Events triggered by AWS Health events triggered by AWS Health triggered by AWS Health events to issue notifications using Amazon SNS, but alerts in the linked accounts failed to trigger. Why did the alerts fail?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "112"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": ""
				},
				"questionAnswerExplanation": {
					"S": ""
				},
				"questionId": {
					"N": "703"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Name each AMI in the new Region exactly the same as the equivalent AMI in the first Region."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Duplicate the stack so unique AMI names can be coded into the appropriate stack."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create an alias for each AMI so that an AMI can be referenced by a common name across Regions."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create a Mappings section in the stack, and define the Region to AMI associations."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company is planning to expand into an additional AWS Region for disaster recovery purposes. The company uses AWS CloudFormation, and its infrastructure is well-defined as code. The company would like to reuse as much of its existing code as possible when deploying resources to additional Regions. A SysOps Administrator is reviewing how Amazon Machine Images (AMIs) are selected in AWS CloudFormation, but is having trouble making the same stack work in the new Region. Which action would make it easier to manage multiple Regions?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "113"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": ""
				},
				"questionAnswerExplanation": {
					"S": ""
				},
				"questionId": {
					"N": "704"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create an AWS Directly Service Simple AD. Replicate the on-premises LDAP directory to Simple AD."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create a Lambda function to read LDAP groups and automate the creation of IAM users."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use AWS CloudFormation to create IAM roles. Deploy Direct Connect to allow access to the onpremises LDAP server."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Federate the LDAP directory with IAM using SAML. Create different IAM roles to correspond to different LDAP groups to limit permissions."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An organization with a large IT department has decided to migrate to AWS. With different job functions in the IT department, it is not desirable to give all users access to all AWS resources. Currently the organization handles access via LDAP group membership. What is the BEST method to allow access using current LDAP credentials?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "114"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": ""
				},
				"questionAnswerExplanation": {
					"S": ""
				},
				"questionId": {
					"N": "705"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Enable Amazon S3 Analytics on all affected S3 buckets to obtain a report of which buckets are being accessed without authorization."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Enable Amazon S3 Server Access Logging on all affected S3 buckets and have the logs stored in a bucket dedicated for logs."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use Amazon Athena to query S3 Analytics report for HTTP 403 errors, and determine the IAM user or role making the requests."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use Amazon Athena to query the S3 Server Access Logs for HTTP 403 errors, and determine the IAM user or role making the requests."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "E"
								},
								"optionText": {
									"S": "Use Amazon Athena to query the S3 Server Access Logs for HTTP 503 errors, and determine the IAM user or role making the requests."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An organization stores sensitive customer in S3 buckets protected by bucket policies. recently, there have been reports that unauthorized entities within the company have been trying to access the data on those S3 buckets. The Chief Information Security Officer (CISO) would like to know which buckets are being targeted and determine who is responsible for trying to access that information. Which steps should a SysOps Administrator take to meet the CISO's requirement? (Choose two.) "
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "115"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "AE"
				},
				"questionAnswerExplanation": {
					"S": "A & E : good answers!! - AWS Trusted Advisor for limits instances - CloudTrail for logs in API CALLS"
				},
				"questionId": {
					"N": "706"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Monitor service limits in AWS Trusted Advisor."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Analyze VPC Flow Logs."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Monitor limits in AWS Systems Manager."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use Amazon Inspector to gather performance information."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "E"
								},
								"optionText": {
									"S": "Check the response for RunInstances requests in AWS CloudTrail logs."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator responsible for an e-commerce web application observes the application does not launch new Amazon EC2 instances at peak times, even though the maximum capacity of the Auto Scaling group has not been reached. What should the Administrator do to identify the underlying problem? (Choose two.)"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "116"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "Access the CloudTrail logs stored in the Amazon S3 bucket tied to Cloud Trail. Use Amazon Athena to extract the information needed to generate the report.You can only search the past 90 days via the console. The question touched on being able to report for 1 year. https://docs.amazonaws.cn/en_us/awscloudtrail/latest/userguide/view-cloudtrail-events.html"
				},
				"questionId": {
					"N": "707"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Using the AWS management Console, search for the user name in the CloudTrail history. Then filter by API and download the report in CSV format."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Use the CloudTrail digest files stored in the company's Amazon S3 bucket. then send the logs to Amazon QuickSight to create the report."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Locate the monthly reports that CloudTrail sends that are emailed to the account's root user. Then forward the reports to the auditor using a secure channel."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Access the CloudTrail logs stored in the Amazon S3 bucket tied to Cloud Trail. Use Amazon Athena to extract the information needed to generate the report."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator must generate a report that provides a breakdown of all API activity by a specific user the course of a year. Given that AWS Cloud Trail was enabled, how can this report be generated?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "117"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/ja_jp/AWSSimpleQueueService/latest/SQSDeveloperGuide/sqs-logging-using-cloudtrail.html"
				},
				"questionId": {
					"N": "708"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "AWS CloudTrail"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Amazon CloudWatch"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "AWS Cost Explorer"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Amazon S3 server access logs"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company received its latest bill with a large increase in the number of requests against Amazon SQS as compared to the month prior. The company is not aware of any changes in its SQS usage. The company is concerned about the cost increase and who or what was making these calls. What should the SysOps Administrator use to validate the calls made to SQS?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "118"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AmazonS3/latest/user-guide/set-bucket-permissions.html"
				},
				"questionId": {
					"N": "709"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Move the S3 bucket from a public subnet to a private subnet in the Amazon VPC."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Change the bucket access control list (ACL) to restrict access to the bucket owner."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Enable server-side encryption for all objects in the bucket."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use only Amazon S3 presigned URLs for accessing objects in the bucket."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An Amazon S3 bucket in a SysOps Administrator's account can be accesses by users in other SWS accounts. How can the Administrator ensure that the bucket is only accessible to members of the Administrator's  AWS account?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "119"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "can I point my zone apex (example.com versus www.example.com) at my Elastic Load Balancer?Yes. Amazon Route 53 offers a special type of record called an 'Alias' record that lets you map your zone apex (example.com) DNS name to the DNS name for your ELB load balancer (such as my-loadbalancer-1234567890.us-west-2.elb.amazonaws.com)"
				},
				"questionId": {
					"N": "710"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "An AAA record for the domain's zone apex"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "An A record for the domain's zone apex"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "A CNAME record for the domain's zone apex"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "An alias record for the domain's zone apex"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company hosts its website on Amazon ECF2 instances behind an ELB Application Load Balancer. The company manages its DNS with Amazon Route 53, and wants to point its domain's zone apex to the website. Which type of record should be used to meet these requirements?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "120"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "Set up different metric filters for each team based on patterns and alerts. Each alarm will notify theappropriate notification list."
				},
				"questionId": {
					"N": "711"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Write an AWS Lambda function that will query the logs every minute and contain the logic of which team to notify on which patterns and issues."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Set up different metric filters for each team based on patterns and alerts. Each alarm will notify the appropriate notification list."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Redesign the aggregation of logs so that each team's relevant parts are sent to a separate log group, then subscribe each team to its respective log group."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create an AWS Auto Scaling group of Amazon EC2 instances that will scale based on the amount of ingested log entries. This group will pull log streams, look for patterns, and send notifications to relevant teams."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company has centralized all its logs into one Amazon CloudWatch Logs log group. The SysOps Administrator is to alert different teams of any issues relevant to them. What is the MOST efficient approach to accomplish this?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "121"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "B seems to be the MOST efficient solution. I have used this feature, to capture all the CloudTrail events and filter out only relevant ones to trigger a lambda function for further processing."
				},
				"questionId": {
					"N": "712"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use an Amazon CloudFront distribution to cache static content, including software patches."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Increase the size of the NAT instance to improve throughput."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Scale out the web servers in advance of patch releases to reduce Auto Scaling delays."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Move the content to IO1 and provision additional IOPS to the volume that contains the software patches."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company website hosts patches for software that is sold globally. The website runs in AWS and performs well until a large software patch is released. The flood of downloads puts a strain on the web servers and leads to a poor customer experience. What can the Sysops Administrator propose to enhance customer experience, create a more available web platform, and keep costs low?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "122"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "it says ALB health check failed, not the EC2. also mentions EC2 instances out of service not one, so even if this is true, it will take both instances not one."
				},
				"questionId": {
					"N": "713"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "The EC2 instances are in the same Availability Zone, causing contention between the two. "
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "The route tables are not updated to allow traffic to flow between the ALB and the EC2 instances."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "The ALB health check has failed, and the ALB has taken EC2 instances out of service."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "The Amazon Route 53 health check has failed, and the ALB has taken EC2 instances out of service."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator created an Application Load balancer (ALB) and placed two Amazon EC2 instances in the same subnet behind the ALB. During monitoring, the Administrator observes HealthyHostCount drop to 1 in Amazon CloudWatch. What is MOST likely causing this issue?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "123"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "I'm going with B. I had initially thought D. However a custom metric will need to be written if you go with D"
				},
				"questionId": {
					"N": "714"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create an Amazon CloudWatch alarm based on the CPUUtilization metric. When the metric is 0% for 24 hours, trigger an action to terminate the EC2 instance when the alarm is triggered."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create an AWS Lambda function to check all EC2 instances and terminate instances running more than 24 hours. Trigger the function with an Amazon CloudWatch Events event every 15 minutes."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Add an action to AWS Trusted Advisor to turn off EC2 instances based on the Low Utilization Amazon EC2 Instances check, terminating instances identified by Trusted Advisor as running for more than 24 hours."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Install the unified Amazon CloudWatch agent on every EC2 instance. Configure the agent to terminate instances after they have been running for 24 hours."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is managing an AWS account where Developers are authorized to launch Amazon EC2 instances to test new code. To limit costs, the Administrator must ensure that the EC2 instances in the account are terminated 24 hours after launch. How should the Administrator meet these requirements?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "124"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "B. The S3 bucket is not in the appropriate region.Pipeline Error: A pipeline created in one AWS region using a bucket created in another AWS region returns an InternalError with the code JobFailed Problem: The download of an artifact stored in an Amazon S3 bucket will fail if the pipeline and bucket are created in different AWS regions.Possible fixes: Make sure the Amazon S3 bucket where your artifact is stored is in the same AWS region as the pipeline you have created."
				},
				"questionId": {
					"N": "715"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "S3 Transfer Acceleration is not enabled."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "The S3 bucket is not in the appropriate region."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "The S3 bucket is being throttled."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "There are insufficient permissions on the artifact in Amazon S3."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An AWS CodePipeline in us-east-1 returns 'InternalError' with the code 'JobFailed' when launching a deployment using an artifact from an Amazon S3 bucket in us-west-1. What is causing this error?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "125"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "D : ScalingUpdatePolicy -> The standard procedure is set to max as 1 and Update the AMI in Launch Configuration . Here the question mentioned to maintain minimum instance. Also when you set max ex : 10 then, new Instance will use the Updated AMI."
				},
				"questionId": {
					"N": "716"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Run the aws cloudfomation update-stack command with the  rollback-configuration option"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Update the CloudFormation template with the new AMI ID, then reboot the EC2 instances"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Deploy a second CloudFormation stack and use Amazon Route 53 to redirect traffic to the new stack"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Set an AutoScalingUpdate policy in the CloudFormation template to update the stack."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "An application running on Amazon EC2 instances in an Auto Scaling group across multiple Availability Zones was deployed using an AWS CloudFormation template. The SysOps team has patched the Amazon Machine Image (AMI) version and must update all the EC2 instances to use the new AMI. How can the SysOps Administrator use CloudFormation to apply the new AMI while maintaining a minimum level of active instances to ensure service continuity?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "126"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "B is the only suitable answer. It can only be scaled VERTICALLY"
				},
				"questionId": {
					"N": "717"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Change the Amazon EBS volume to Provisioned IOPs."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Upgrade to a compute-optimized instance."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Add additional t2.large instances to the application. "
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Purchase Reserved Instances."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is responsible for a legacy, CPU-heavy application. The application can only be scaled vertically. Currently, the application is deployed on a single t2.large Amazon EC2 instance. The system is showing 90% CPU usage and significant performance latency after a few minutes. What change should be made to alleviate the performance problem?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "127"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "AC"
				},
				"questionAnswerExplanation": {
					"S": "AC should be correct tried to recover via cli and i was able tohttps://aws.amazon.com/premiumsupport/knowledge-center/s3-undelete-configuration/"
				},
				"questionId": {
					"N": "718"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Use the AWS Management Console to delete the object delete markers."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create a new lifecycle rule to delete the object delete markers that were created."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use the AWS CLI to delete the object delete markers while specifying the version IDs of the delete markers."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Modify the existing lifecycle rule to delete the object delete markers that were created."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "E"
								},
								"optionText": {
									"S": "Use the AWS CLI to delete the object delete markers while specifying the name of the objects only."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company recently implemented an Amazon S3 lifecycle rule that accidentally deleted objects from one of its S3 buckets. The bucket has S3 versioning enabled. Which actions will restore the objects? (Choose two.)"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "128"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "The question specifically calls out the DevOps Team and the CF Security BP calls out you can securely control access to AWS services and resources by using policies and users or roles. In addition, it calls out As a best practice, we recommend that you limit service and resource access through IAM policies by applying the principle of least privilege. https://aws.amazon.com/blogs/devops/aws-cloudformation-security-best-practices/"
				},
				"questionId": {
					"N": "719"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Set up an AWS Config rule to alert based on changes to any CloudFormation stack. An AWS Lambda function can then describe the stack to determine if any protected resources were modified and cancel the operation."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Set up an Amazon CloudWatch Events event with a rule to trigger based on any CloudFormation API call. An AWS Lambda function can then describe the stack to determine if any protected resources were modified and cancel the operation."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Launch the CloudFormation templates using a stack policy with an explicit allow for all resources and an explicit deny of the protected resources with an action of Update:*."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Attach an IAM policy to the DevOps team role that prevents a CloudFormation stack from updating, with a condition based on the specific Amazon Resource names (ARNs) of the protected resources."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company uses AWS CloudFormation to deploy its application infrastructure. Recently, a user accidentally changed a property of a database in a CloudFormation template and performed a stack update that caused an interruption to the application. A SysOps Administrator must determine how to modify the deployment process to allow the DevOps team to continue to deploy the infrastructure, but prevent against accidental modifications to specific resources. Which solution will meet these requirements?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "129"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "AWS Cost and Usage report https://docs.aws.amazon.com/awsaccountbilling/latest/aboutv2/con-bill-blended-rates.html"
				},
				"questionId": {
					"N": "720"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "AWS Budgets"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "AWS Cost and Usage report"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "AWS Trusted Advisor"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "AWS Organizations"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is analyzing how Reserved Instance discounts are allocated to Amazon EC2 instances across accounts in the company's consolidated bill. Which AWS tool will provide the details necessary to understand the billing charges?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "130"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "B. The AWS Health API shows scheduled maintenance. The AWS Service Health Dashboard only shows service interruptions. Phd = HEALTH api"
				},
				"questionId": {
					"N": "721"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Run a script that queries AWS Systems Manager for upcoming maintenance events, and then push these events to an Amazon SNS topic to which the Operations team is subscribed."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Query the AWS Health API for upcoming maintenance events and integrate the results with the company's existing operations dashboard."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Integrate the AWS Service Health Dashboard's RSS feed into the company's existing operations dashboard."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use Amazon Inspector to send notifications of upcoming maintenance events to the Operations team  distribution list."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "What should a SysOps Administrator do to ensure a company has visibility into maintenance events performed by AWS?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "131"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "If there are no healthy instances but the EC2 are working fine, review that the healthcheck endpoint works properly and see if it is correctly configured on the ELB"
				},
				"questionId": {
					"N": "722"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Review the application's logs for requests originating from the VPC DNS address."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Review the load balancer access logs, looking for any issues or errors."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Review the load balancer target group health check configuration."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Review the load balancer listener configuration."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator manages a website running on Amazon EC2 instances behind an ELB Application Load Balancer. Users visiting the load balancer's DNS address in a browser are reporting errors. The administrator has confirmed: The security groups and network ACLs are correctly configured. The load balancer target group shows no healthy instances. What should the Administrator do to resolve this issue?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "132"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "Verify if you've configured reserved concurrency on your Lambda function. Check the setting using the Lambda console, or by calling the GetFunction API.Note: If a function is configured to have zero reserved concurrency, then the function is throttled because it can't process any events. Be sure to increase the value to a number greater than zero."
				},
				"questionId": {
					"N": "723"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Redeploy the operational function to a VPC."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Increase the operational function timeout."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Set the operational function concurrency to 1."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Increase the operational function memory."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company is running multiple AWS Lambda functions in a non-VPC environment. Most of the functions are application-specific; an operational function is involved synchronously every hour. Recently, the Applications team deployed new functions that are triggered based on an Amazon S3 event to process multiple files that are uploaded to an S3 bucket simultaneously. The SysOps Administrator notices that the operational function occasionally fails to execute due to throttling. What step should the Administrator take to make sure that the operational function executes?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "133"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "AWS Config => Checks whether the EBS volumes that are in an attached state are encrypted. If you specify the ID of a KMS key for encryption using the kmsId parameter, the rule checks if the EBS volumes in an attached state are encrypted with that KMS key."
				},
				"questionId": {
					"N": "724"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create an AWS Lambda function to run on a daily schedule, and have the function run the aws ec2 describe-volumes --filters encrypted command."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Within AWS Config, configure the encrypted-volumes managed rule and specify the key ID of the CMK."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Log in to the AWS Management Console on a daily schedule, then filter the list of volumes by encryption status, then export this list."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create an AWS Lambda function to run on a daily schedule, and have the function run the aws kms describe-key command."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator must ensure all Amazon EBS volumes currently in use, and those created in the future, are encrypted with a specific AWS KMS customer master key (CMK). What is the MOST efficient way for the Administrator to meet this requirement?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "134"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "https://aws.amazon.com/blogs/mt/patching-your-windows-ec2-instances-using-aws-systems-manager-patch-manager/"
				},
				"questionId": {
					"N": "725"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Change the number of instances patched at any one time to 100%. "
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create a snapshot of each server in the fleet using a Systems Manager Automation document before starting the patch process."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Configure the maintenance window to patch 10% of the instances in the patch group at a time."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create a patched Amazon Machine Image (AMI). Configure the maintenance window option to deploy the patched AMI on only 10% of the fleet at a time."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company has an application running on a fleet of Microsoft Windows instances. Patches to the operating system need to be applied each month. AWS Systems Manager Patch Manager is used to apply the patches on a schedule. When the fleet is being patched, customers complain about delayed service responses. What can be done to ensure patches are deployed with MINIMAL customer impact?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "135"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "I don't think AWS config can be used to centrally manage external devices. In order to manage them AWS Systems Manager is the way to go.I would go with B. AWS System ManagerRef: https://aws.amazon.com/blogs/mt/manage-raspberry-pi-devices-using-aws-systems-manager/"
				},
				"questionId": {
					"N": "726"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "AWS Config"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "AWS Systems Manager"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Amazon Inspector"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "AWS Service Catalog"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A local agency plans to deploy 500 Raspberry Pi devices throughout a city. All the devices need to be managed centrally, and their configurations need to be consistent. What is the BEST service for managing these devices?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "136"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "SC1 is backed by hard disk drives (HDDs) and provides the lowest cost per GB of all EBS volume types. It is ideal for less frequently accessed workloads with large, cold datasets. Similar to st1, sc1 provides a burst model: these volumes can burst up to 80 MB/s per TB, with a baseline throughput of 12 MB/s per TB and a maximum throughput of 250 MB/s per volume. For infrequently accessed data, sc1 provides extremely inexpensive storage. SC1 is designed to deliver the expected throughput performance 99% of the time and has enough I/O credits to support a full-volume scan at the burst rate.Reference:https://aws.amazon.com/ebs/features/"
				},
				"questionId": {
					"N": "727"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Provisioned IOPS SSD (io1)"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Cold HDD (sc1)"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Throughput Optimized HDD (st1)"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "General Purpose SSD (gp2)"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator needs an Amazon EBS volume type for a big data application. The application data is accessed infrequently and stored sequentially. What EBS volume type will be the MOST cost-effective solution?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "137"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/servicecatalog/latest/adminguide/catalogs_portfolios_sharing.html"
				},
				"questionId": {
					"N": "728"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Add a product from the imported portfolio to a local portfolio."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Add new products to the imported portfolio."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Change the launch role for the products contained in the imported portfolio."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Remove products from the imported portfolio."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator created an AWS Service Catalog portfolio and shared the portfolio with a second AWS account in the company. The second account is controlled by a different Administrator. Which action will the Administrator of the second account be able to perform?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "138"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "CD"
				},
				"questionAnswerExplanation": {
					"S": "The CloudTrail log file integrity validation process also lets you know if a log file has been deleted or changed, or assert positively that no log files were delivered to your account during a given period of time. CloudTrail log file integrity validation uses industry standard algorithms: SHA-256 for hashing and SHA-256 withRSA for digital signing. This makes it computationally unfeasible to modify, delete or forge CloudTrail log files without detection. TConfiguring multi-factor authentication (MFA) ensures that any attempt to change the versioning state of your bucket or permanently delete an object version requires additional authentication. This helps prevent any operation that could compromise the integrity of your log files, even if a user acquires the password of an IAM user that has permissions to permanently delete Amazon S3 objects.Reference:https://docs.aws.amazon.com/awscloudtrail/latest/userguide/best-practices-security.html"
				},
				"questionId": {
					"N": "729"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Enable the CloudTrail log file integrity check in AWS Config Rules."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Use CloudWatch Events to scan log files hourly."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Enable CloudTrail log file integrity validation."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Turn on Amazon S3 MFA Delete for the CloudTrail bucket."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "E"
								},
								"optionText": {
									"S": "Implement a DENY ALL bucket policy on the CloudTrail bucket."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator must secure AWS CloudTrail logs. The Security team is concerned that an employee may modify or attempt to delete CloudTrail log files from its Amazon S3 bucket. Which practices will ensure that the log files are available and unaltered? (Choose two.)"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "139"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "If you want to use your own domain name, use Amazon Route 53 to create an alias record that points to your CloudFront distribution. An alias record is a Route 53 extension to DNS."
				},
				"questionId": {
					"N": "730"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create a CNAME record in Amazon Route 53 that points to the CloudFront distribution URL."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create an ALIAS record in Amazon Route 53 that points to the CloudFront distribution URL."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create an A record in Amazon Route 53 that points to the public IP address of the web application."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create a PTR record in Amazon Route 53 that points to the public IP address of the web application."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company runs a web application that users access using the domain name www.example.com. The company manages the domain name using Amazon Route 53. The company created an Amazon  CloudFront distribution in front of the application and would like www.example.com to access the application through CloudFront. What is the MOST cost-effective way to achieve this?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "140"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "you can use service control policies (SCPs) to specify the maximum permissions for member accounts in the organization. In SCPs, you can restrict which AWS services, resources, and individual API actions the users and roles in each member account can access. You can also define conditions for when to restrict access to AWS services, resources, and API actions. These restrictions even override the administrators of member accounts in the organization. When AWS Organizations blocks access to a service, resource, or API action for a member account, a user or role in that account can't access it. This block remains in effect even if an administrator of a member account explicitly grants such permissions in an IAM policy.https://docs.aws.amazon.com/organizations/latest/userguide/orgs_introduction.html"
				},
				"questionId": {
					"N": "731"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Set up MFA Delete on all the S3 buckets to prevent the buckets from being deleted."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Use service control policies to deny the s3:DeleteBucket action on all buckets in production accounts."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create an IAM group that has an IAM policy to deny the s3:DeleteBucket action on all buckets in production accounts."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Use AWS Shield to deny the s3:DeleteBucket action on the AWS account instead of all S3 buckets."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company using AWS Organizations requires that no Amazon S3 buckets in its production accounts should ever be deleted. What is the SIMPLEST approach the SysOps Administrator can take to ensure S3 buckets in those accounts can never be deleted?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "141"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "To route domain traffic to an ELB load balancer, use Amazon Route 53 to create an alias record that points to your load balancer"
				},
				"questionId": {
					"N": "732"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create an Amazon EC2 proxy in Account A that forwards requests to Account B."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create a load balancer in Account A that points to the load balancer in Account B."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create a CNAME record in Account A pointing to an alias record to the load balancer in Account B."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create an alias record in Account A pointing to the load balancer in Account B."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company uses multiple accounts for its applications. Account A manages the company's Amazon Route 53 domains and hosted zones. Account B uses a load balancer fronting the company's web servers. How can the company use Route 53 to point to the load balancer in the MOST cost-effective and efficient manner?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "142"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "Modify the Condition operator to include both NotIpAddress and IpAddress to preventunauthorized access to the S3 bucket."
				},
				"questionId": {
					"N": "733"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Modify the Condition operator to include both NotIpAddress and IpAddress to prevent unauthorized access to the S3 bucket."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Modify the Condition element from the IAM policy to aws:StringEquals instead of aws:SourceIp."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Modify the IAM policy instead of the bucket policy to restrict users from accessing the bucket based on their source IP addresses."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Change Effect from Allow to Deny in the second statement of the policy to deny requests not from the source IP range."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator implemented the following bucket policy to allow only the corporate IP address range of 54.240.143.0/24 to access objects in an Amazon S3 bucket.  Some employees are reporting that they are able to access the S3 bucket from IP addresses outside the corporate IP address range. How can the Administrator address this issue?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "143"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "Periodically, Amazon RDS performs maintenance on Amazon RDS resources. Maintenance most often involves updates to the DB cluster's underlying hardware, underlying operating system (OS), or database engine version. Updates to the operating system most often occur for security issues and should be done as soon as possible.https://docs.aws.amazon.com/AmazonRDS/latest/AuroraUserGuide/USER_UpgradeDBInstance.Maintenance.html"
				},
				"questionId": {
					"N": "734"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "The database vendor"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "The Security department of the SysOps Administrator's company"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "AWS"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "The SysOps Administrator"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is notified that a security vulnerability affects a version of MySQL that is being used with Amazon RDS MySQL. Who is responsible for ensuring that the patch is applied to the MySQL cluster? "
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "144"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "CD"
				},
				"questionAnswerExplanation": {
					"S": "C & D is correct. RDS and Elasticache is AWS managed service where you can specify maintenance windows for AWS to deploy patches etc."
				},
				"questionId": {
					"N": "735"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Elastic Load Balancer"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "EC2 instances"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "RDS instance"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "ElastiCache cluster"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "E"
								},
								"optionText": {
									"S": "Auto Scaling group"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company's web application runs on Amazon EC2 instances behind an ELB Application Load Balancer. The EC2 instances run in an EC2 Auto Scaling group across multiple Availability Zones. Data is stored in an Amazon ElastiCache for Redis cluster and an Amazon RDS DB instance. Company policy requires all system patching to take place at midnight on Tuesday. Which resources will need to have a maintenance window configured for midnight on Tuesday? (Choose two.)"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "145"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "AC"
				},
				"questionAnswerExplanation": {
					"S": "https://aws.amazon.com/cloudfront/faqs/https://docs.aws.amazon.com/Route53/latest/DeveloperGuide/routing-policy.html"
				},
				"questionId": {
					"N": "736"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Amazon CloudFront geo-restriction"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Amazon GuardDuty geo-blocking"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Amazon Route 53 geolocation routing"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "AWS Shield geo-restriction"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "E"
								},
								"optionText": {
									"S": "Network access control list (NACL) restriction"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is deploying a website with dynamic content. Company policy requires that users from certain countries or regions cannot access the web content and should receive an error page. Which of the following can be used to implement this policy? (Choose two.)"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "146"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "Answer is C The word daily is defining the answer Why would I choose to use Standard - IA Standard - IA is ideal for data that is accessed less frequently, but requires rapid access when needed. Standard - IA is ideally suited for long-term file storage, older data from sync and share, backup data, and disaster recovery files."
				},
				"questionId": {
					"N": "737"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Amazon Glacier"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Amazon S3 Standard IA (infrequent access) storage"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Amazon S3 Standard Storage"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "AWS Snowball"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company stores thousands of non-critical log files in an Amazon S3 bucket. A set of reporting scripts retrieve these log files daily. Which of the following storage options will be the MOST cost-efficient for the company's use case?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "147"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "The security group is not allowing inbound traffic from the home network on the SSH port."
				},
				"questionId": {
					"N": "738"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "The IAM role associated with the EC2 instance does not allow SSH connections from the home network."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "The public key used by SSH located on the Administrator's server does not have the required permissions."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "The route table contains a route that sends 0.0.0.0/0 to the internet gateway for the VPC. "
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "The security group is not allowing inbound traffic from the home network on the SSH port."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator receives a connection timeout error when attempting to connect to an Amazon EC2 instance from a home network using SSH. The Administrator was able to connect to this EC2 instance using from their office network in the past. What caused the connection to time out?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "148"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "It says it must wait for the script to run successfully on the instance. In Cloud formation you use AWS::CloudFormation::Init to run the script commands on the machine after all the commands are completed there must be sent a signal of success or fail cfn-signal.exe -e %ERRORLEVEL% --resource (your resource) --stack ${AWS::StackId} --region ${AWS::Region}.If you dont specify this the cloud formation will consider the instance completed successfully without waiting for the signal confirmation and moves to creation of the next resource and you are not 100% sure your script has run ok or failed.So the correct answer is C. Init (AWS::CloudFormation::Init)"
				},
				"questionId": {
					"N": "739"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "CustomResource"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "DependsOn"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Init"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "WaitCondition"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company is deploying a web service to Amazon EC2 instances behind an Elastic Load Balancer. All resources will be defined and created in a single AWS CloudFormation stack using a template. The creation of each EC2 instance will not be considered complete until an initialization script has been run successfully on the EC2 instance. The Elastic Load Balancer cannot be created until all EC2 instances have been created. Which CloudFormation resource will coordinate the Elastic Load Balancer creation in the CloudFormation stack template?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "149"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "D : is the good answer with AWS Systems Manager using the Run Command and the Patching feature!"
				},
				"questionId": {
					"N": "740"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Patch the vulnerability with Amazon Inspector."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Provide an AWS Trusted Advisor report showing which Amazon EC2 instances have been patched."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Redeploy the Amazon EC2 instances using AWS CloudFormation."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Patch the Linux operating system using AWS Systems Manager."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company is concerned about a security vulnerability impacting its Linux operating system. What should the SysOps Administrator do to alleviate this concern?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "150"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "You can create users in AWS SSO by configuring their email address and name. When you create a user, AWS SSO sends an email to the user by default so that they can set their own password. Your user will use their email address and a password they configure in AWS SSO to sign into the user portal and access all of their assigned accounts and applications in a single place.You can also add the users that you create in AWS SSO to groups you create in AWS SSO. In addition, you can create permissions sets that define permitted actions on an AWS resource, and assign them to your users and groups. For example, you can grant the DevOps group permissions to your production AWS accounts. When you add users to the DevOps group, they get access to your production AWS accounts automatically.https://aws.amazon.com/blogs/security/how-to-create-and-manage-users-within-aws-sso/"
				},
				"questionId": {
					"N": "741"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create IAM roles in each account to be used by AWS SSO, and associate users with these roles using AWS SSO."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create IAM users in the master account, and use AWS SSO to associate the users with the accounts they will access."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create permission sets in AWS SSO, and associate the permission sets with Directory Service users or groups."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create service control policies (SCPs) in Organizations, and associate the SCPs with Directory Service users or groups."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is configuring AWS SSO for the first time. The Administrator has already created a directory in the master account using AWS Directory Service and enabled full access in AWS Organizations. What should the Administrator do next to configure the service?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "151"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "Rather than embedding sensitive information in your AWS CloudFormation templates, we recommend you use dynamic references in your stack template.Dynamic references provide a compact, powerful way for you to reference external values that are stored and managed in other services, such as the AWS Systems Manager Parameter Store or AWS Secrets Manager. When you use a dynamic reference, CloudFormation retrieves the value of the specified reference when necessary during stack and change set operations, and passes the value to the appropriate resource. However, CloudFormation never stores the actual reference value. For more information, see Using Dynamic References to Specify Template Values.https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/best-practices.html#creds"
				},
				"questionId": {
					"N": "742"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Pass the credentials for the target environment to the CloudFormation template as parameters. Use the user data script to insert the parameterized credentials into the EC2 instances."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Store the credentials as secure strings in AWS Systems Manager Parameter Store. Pass an environment tag as a parameter to the CloudFormation template. Use the user data script to insert the  environment tag in the EC2 instances. Access the credentials from the application."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create a separate CloudFormation template for each environment. In the Resources section, include a user data script for each EC2 instance. Use the user data script to insert the proper credentials for the environment into the EC2 instances."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create separate Amazon Machine Images (AMIs) with the required credentials for each environment. Pass the environment tag as a parameter to the CloudFormation template. In the Mappings section of the CloudFormation template, map the environment tag to the proper AMI, then use that AMI when launching the EC2 instances."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A web application runs on Amazon EC2 instances and accesses external services. The external services require authentication credentials. The application is deployed using AWS CloudFormation to three separate environments: development, test, and production. Each environment requires unique credentials for external services. What option securely provides the application with the needed credentials while requiring MINIMAL administrative overhead?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "152"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "ROLLBACK_COMPLETESuccessful removal of one or more stacks after a failed stack creation or after an explicitly canceled stack creation. Any resources that were created during the create stack action are deleted.This status exists only after a failed stack creation. It signifies that all operations from the partially created stack have been appropriately cleaned up. When in this state, only a delete operation can be performed."
				},
				"questionId": {
					"N": "743"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Delete the failed stack and create a new stack."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Execute a change set on the failed stack."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Perform an update-stack action on the failed stack."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Run a validate-template command."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator created an AWS CloudFormation template for the first time. The stack failed with a status of ROLLBACK_COMPLETE. The Administrator identified and resolved the template issue causing the failure. How should the Administrator continue with the stack deployment?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "153"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/USER_ShareSnapshot.html"
				},
				"questionId": {
					"N": "744"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Write a script to download the encrypted snapshot, decrypt it using the AWS KMS encryption key used to encrypt the snapshot, then create a new volume in each account."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Update the key policy to grant permission to the AWS KMS encryption key used to encrypt the snapshot with all relevant accounts, then share the snapshot with those accounts."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Create an Amazon EC2 instance based on the snapshot, then save the instance's Amazon EBS volume as a snapshot and share it with the other accounts. Require each account owner to create a new volume from that snapshot and encrypt it."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Create a new unencrypted RDS instance from the encrypted snapshot, connect to the instance using SSH/RDP, export the database contents into a file, then share this file with the other accounts."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is building a process for sharing Amazon RDS database snapshots between different accounts associated with different business units within the same company. All data must be encrypted at rest. How should the Administrator implement this process?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "154"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "is the good answer ; that is the role of the AWS Inspector ! https://aws.amazon.com/inspector/faqs/"
				},
				"questionId": {
					"N": "745"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Create and run an Amazon Inspector assessment template."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Manually SSH into each instance and check the software version."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Use AWS CloudTrail to verify Amazon EC2 activity in the account."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Write a custom script and use AWS CodeDeploy to deploy to Amazon EC2 instances."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator has been notified that some Amazon EC2 instances in the company's environment might have a vulnerable software version installed. What should be done to check all of the instances in the environment with the LEAST operational overhead?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "155"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "Budget https://aws.amazon.com/about-aws/whats-new/2017/12/aws-free-tier-usage-alerts-automatically-notify-you-when-you-are-forecasted-to-exceed-your-aws-service-usage-limits/"
				},
				"questionId": {
					"N": "746"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "AWS Budgets"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "AWS Cost Explorer"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "AWS Trusted Advisor"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "AWS Cost and Usage report"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "Development teams are maintaining several workloads on AWS. Company management is concerned about rising costs and wants the SysOps Administrator to configure alerts so teams are notified when spending approaches preset limits. Which AWS service will satisfy these requirements? "
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "156"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "A structure that contains information about a stack set. A stack set enables you to provision stacks into AWS accounts and across Regions by using a single CloudFormation template. In the stack set, you specify the template to use, as well as any parameters and capabilities that the template requires.https://docs.aws.amazon.com/AWSCloudFormation/latest/APIReference/API_StackSet.html"
				},
				"questionId": {
					"N": "747"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Change sets"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Nested stacks"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Stack policies"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "StackSets"
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is tasked with deploying and managing a single CloudFormation template across multiple AWS accounts. What feature of AWS CloudFormation will accomplish this?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "157"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "Due to high queries, scaling up will sort the problem"
				},
				"questionId": {
					"N": "748"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Configure AWS Database Migration Service (AWS DMS) to allow Amazon RDS for MySQL to scale and accept more requests."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Configure RDS for MySQL to scale horizontally by adding additional nodes to offload write requests."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Enable the Multi-AZ feature for the RDS instance."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Modify the RDS MySQL instance so it is a larger instance type."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company runs an application that uses Amazon RDS for MySQL. During load testing of equivalent production volumes, the Development team noticed a significant increase in query latency. A SysOps Administrator concludes from investigating Amazon CloudWatch Logs that the CPU utilization on the RDS MySQL instance was at 100%. Which action will resolve this issue?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "158"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "C"
				},
				"questionAnswerExplanation": {
					"S": "When you enable automatic key rotation for a customer managed CMK, AWS KMS generates new cryptographic material for the CMK every year. AWS KMS also saves the CMK's older cryptographic material in perpetuity so it can be used to decrypt data that it encrypted. AWS KMS does not delete any rotated key material until you delete the CMK.https://docs.aws.amazon.com/kms/latest/developerguide/rotate-keys.html"
				},
				"questionId": {
					"N": "749"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Back up the current KMS key and enable automatic key rotation."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Create a new key in AWS KMS and assign the key to Amazon EBS."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Enable automatic key rotation of the EBS volume key in AWS KMS."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Upload new key material to the EBS volume key in AWS KMS to enable automatic key rotation for the volume."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator is using AWS KMS with AWS-generated key material to encrypt an Amazon EBS volume in a company's AWS environment. The Administrator wants to rotate the KMS keys using automatic key rotation, and needs to ensure that the EBS volume encrypted with the current key remains readable. What should be done to accomplish this?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "159"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "A"
				},
				"questionAnswerExplanation": {
					"S": "An Auto Scaling group to manage EC2 instances for the purposes of processing messages from an SQS queue.A custom metric to send to Amazon CloudWatch that measures the number of messages in the queue per EC2 instance in the Auto Scaling group.A target tracking policy that configures your Auto Scaling group to scale based on the custom metric and a set target value. CloudWatch alarms invoke the scaling policy.https://docs.aws.amazon.com/autoscaling/ec2/userguide/as-using-sqs-queue.html"
				},
				"questionId": {
					"N": "750"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Change the scaling policy to scale based upon the number of messages in the queue."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Decouple the queue from the Elastic Beanstalk worker node and create it as a separate resource. "
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Increase the number of messages in the queue."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Increase the retention period of the queue."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A SysOps Administrator deployed an AWS Elastic Beanstalk worker node environment that reads messages from an auto-generated Amazon Simple Queue Service (Amazon SQS) queue and deletes them from the queue after processing. Amazon EC2 Auto Scaling scales in and scales out the number of worker nodes based on CPU utilization. After some time, the Administrator notices that the number of messages in the SQS queue are increasing significantly. Which action will remediate this issue?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "160"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "I don't think that B is correct. If the servers don't have a static public IP (EIP) it is still possible to have a dynamic public IP and with a route to the internet it will be allowed to communicate to the internet.D is correct"
				},
				"questionId": {
					"N": "751"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Edit the route for the subnet with the following entry: Destination 0.0.0.0/0 target: igw-xxxxxxxx"
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Ensure that the servers do not have Elastic IP addresses."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Enable Enhanced Networking on the instances to control traffic flows."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Put the servers in a private subnet."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A Security team is concerned about the potential of intellectual property leaking to the internet. A SysOps Administrator is tasked with identifying controls to address the potential problem. The servers in question reside in a VPC and cannot be allowed to send traffic to the internet. How can these requirements be met?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "161"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "To enable the flow of traffic between the VPCs using private IP addresses, the owner of each VPC in the VPC peering connection must manually add a route to one or more of their VPC route tables that points to the IP address range of the other VPC (the peer VPC).https://docs.aws.amazon.com/vpc/latest/peering/vpc-peering-basics.html"
				},
				"questionId": {
					"N": "752"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Ensure that both accounts are linked and are part of consolidated billing to create a file sharing network, and then enable VPC peering."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Ensure that both VPC owners manually add a route to the VPC route tables that points to the IP address range of the other VPC."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Instruct the customer to set up a VPC with the same IPv4 CIDR block as that of the source VPC: 172.16.0.0/16."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Instruct the customer to create a virtual private gateway to link the two VPCs."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company is setting up a VPC peering connection between its VPC and a customer's VPC. The company VPC is an IPv4 CIDR block of 172.16.0.0/16, and the customer's is an IPv4 CIDR block of 10.0.0.0/16. The SysOps Administrator wants to be able to ping the customer's database private IP address from one of the company's Amazon EC2 instances. What action should be taken to meet the requirements?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "162"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "B"
				},
				"questionAnswerExplanation": {
					"S": "With Inter-Region VPC peering, the traffic in encryptedhttps://docs.aws.amazon.com/vpc/latest/peering/what-is-vpc-peering.html"
				},
				"questionId": {
					"N": "753"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Configure EC2 instances to act as VPN appliances, then configure route tables."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Configure inter-region VPC peering between the two VPCs, then configure route tables."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Configure NAT gateways in both VPCs, then configure route tables."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "Configure an internet gateway in each VPC, and use these as the targets for the VPC route tables."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "A company is concerned about its ability to recover from a disaster because all of its Amazon EC2 instances are located in a single Amazon VPC in us-east-1. A second Amazon VPC has been configured in eu-west-1 to act as a backup VPC in case of an outage. Data will be replicated from the primary region to the secondary region. The Information Security team's compliance requirements specify that all data must be encrypted and must not traverse the public internet. How should the SysOps Administrator connect the two VPCs while meeting the compliance requirements?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "163"
				}
			}
		}
	}, {
		"PutRequest": {
			"Item": {
				"questionAnswer": {
					"S": "D"
				},
				"questionAnswerExplanation": {
					"S": "Took me a while to understand. They keyword here is OVERLAP. That's enough to explain that a peering connection is needed."
				},
				"questionId": {
					"N": "754"
				},
				"questionOptions": {
					"L": [{
							"M": {
								"optionId": {
									"S": "A"
								},
								"optionText": {
									"S": "Each Administrator should create a custom routing table that points to the other company's internet gateway public IP address. "
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "B"
								},
								"optionText": {
									"S": "Both Administrators should set up a NAT gateway in a public subnet in their respective VPCs. Then. using the public IP address from the NAT gateway, the Administrators should enable routing between the two VPCs."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "C"
								},
								"optionText": {
									"S": "Both Administrators should install a 1 Gbps AWS Direct Connect circuit in their respective environments. Then, using the AWS Management Console, the Administrators should create an AWS Direct Connect routing requests to enable connectivity."
								}
							}
						},
						{
							"M": {
								"optionId": {
									"S": "D"
								},
								"optionText": {
									"S": "One Administrator should create a VPC peering request and send it to the other Administrator's account. Once the other Administrator accepts the request, update the routing tables to enable traffic."
								}
							}
						}
					]
				},
				"questionText": {
					"S": "Two companies will be working on several development projects together. Each company has an AWS account with a single VPC in us-east-1. Two companies would like to access one another's development servers. The IPv4 CIDR blocks in the two VPCs does not overlap. What can the SysOps Administrators for each company do to set up network routing?"
				},
				"examId": {
					"S": "SOA-C01"
				},
				"questionSkId": {
					"N": "164"
				}
			}
		}
	}]
}